MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1788/mcu.h
extern volatile ODCONAbits_t ODCONAbits __at(0x28C);
// bitfield macros
#define _ODCONA_ODCONA0_POSN                                0x0
#define _ODCONA_ODCONA0_POSITION                            0x0
#define _ODCONA_ODCONA0_SIZE                                0x1
#define _ODCONA_ODCONA0_LENGTH                              0x1
#define _ODCONA_ODCONA0_MASK                                0x1
#define _ODCONA_ODCONA1_POSN                                0x1
#define _ODCONA_ODCONA1_POSITION                            0x1
#define _ODCONA_ODCONA1_SIZE                                0x1
#define _ODCONA_ODCONA1_LENGTH                              0x1
#define _ODCONA_ODCONA1_MASK                                0x2
#define _ODCONA_ODCONA2_POSN                                0x2
#define _ODCONA_ODCONA2_POSITION                            0x2
#define _ODCONA_ODCONA2_SIZE                                0x1
#define _ODCONA_ODCONA2_LENGTH                              0x1
#define _ODCONA_ODCONA2_MASK                                0x4
#define _ODCONA_ODCONA3_POSN                                0x3
#define _ODCONA_ODCONA3_POSITION                            0x3
#define _ODCONA_ODCONA3_SIZE                                0x1
#define _ODCONA_ODCONA3_LENGTH                              0x1
#define _ODCONA_ODCONA3_MASK                                0x8
#define _ODCONA_ODCONA4_POSN                                0x4
#define _ODCONA_ODCONA4_POSITION                            0x4
#define _ODCONA_ODCONA4_SIZE                                0x1
#define _ODCONA_ODCONA4_LENGTH                              0x1
#define _ODCONA_ODCONA4_MASK                                0x10
#define _ODCONA_ODCONA5_POSN                                0x5
#define _ODCONA_ODCONA5_POSITION                            0x5
#define _ODCONA_ODCONA5_SIZE                                0x1
#define _ODCONA_ODCONA5_LENGTH                              0x1
#define _ODCONA_ODCONA5_MASK                                0x20
#define _ODCONA_ODCONA6_POSN                                0x6
#define _ODCONA_ODCONA6_POSITION                            0x6
#define _ODCONA_ODCONA6_SIZE                                0x1
#define _ODCONA_ODCONA6_LENGTH                              0x1
#define _ODCONA_ODCONA6_MASK                                0x40
#define _ODCONA_ODCONA7_POSN                                0x7
#define _ODCONA_ODCONA7_POSITION                            0x7
#define _ODCONA_ODCONA7_SIZE                                0x1
#define _ODCONA_ODCONA7_LENGTH                              0x1
#define _ODCONA_ODCONA7_MASK                                0x80
#define _ODCONA_ODCONA_POSN                                 0x0
#define _ODCONA_ODCONA_POSITION                             0x0
#define _ODCONA_ODCONA_SIZE                                 0x8
#define _ODCONA_ODCONA_LENGTH                               0x8
#define _ODCONA_ODCONA_MASK                                 0xFF

// Register: ODCONB
#define ODCONB ODCONB
extern volatile unsigned char           ODCONB              __at(0x28D);
#ifndef _LIB_BUILD
asm("ODCONB equ 028Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCONB0                :1;
        unsigned ODCONB1                :1;
        unsigned ODCONB2                :1;
        unsigned ODCONB3                :1;
        unsigned ODCONB4                :1;
        unsigned ODCONB5                :1;
        unsigned ODCONB6                :1;
        unsigned ODCONB7                :1;
    };
    struct {
        unsigned ODCONB                 :8;
    };
} ODCONBbits_t;
extern volatile ODCONBbits_t ODCONBbits __at(0x28D);
// bitfield macros
#define _ODCONB_ODCONB0_POSN                                0x0
#define _ODCONB_ODCONB0_POSITION                            0x0
#define _ODCONB_ODCONB0_SIZE                                0x1
#define _ODCONB_ODCONB0_LENGTH                              0x1
#define _ODCONB_ODCONB0_MASK                                0x1
#define _ODCONB_ODCONB1_POSN                                0x1
#define _ODCONB_ODCONB1_POSITION                            0x1
#define _ODCONB_ODCONB1_SIZE                                0x1
#define _ODCONB_ODCONB1_LENGTH                              0x1
#define _ODCONB_ODCONB1_MASK                                0x2
#define _ODCONB_ODCONB2_POSN                                0x2
#define _ODCONB_ODCONB2_POSITION                            0x2
#define _ODCONB_ODCONB2_SIZE                                0x1
#define _ODCONB_ODCONB2_LENGTH                              0x1
#define _ODCONB_ODCONB2_MASK                                0x4
#define _ODCONB_ODCONB3_POSN                                0x3
#define _ODCONB_ODCONB3_POSITION                            0x3
#define _ODCONB_ODCONB3_SIZE                                0x1
#define _ODCONB_ODCONB3_LENGTH                              0x1
#define _ODCONB_ODCONB3_MASK                                0x8
#define _ODCONB_ODCONB4_POSN                                0x4
#define _ODCONB_ODCONB4_POSITION                            0x4
#define _ODCONB_ODCONB4_SIZE                                0x1
#define _ODCONB_ODCONB4_LENGTH                              0x1
#define _ODCONB_ODCONB4_MASK                                0x10
#define _ODCONB_ODCONB5_POSN                                0x5
#define _ODCONB_ODCONB5_POSITION                            0x5
#define _ODCONB_ODCONB5_SIZE                                0x1
#define _ODCONB_ODCONB5_LENGTH                              0x1
#define _ODCONB_ODCONB5_MASK                                0x20
#define _ODCONB_ODCONB6_POSN                                0x6
#define _ODCONB_ODCONB6_POSITION                            0x6
#define _ODCONB_ODCONB6_SIZE                                0x1
#define _ODCONB_ODCONB6_LENGTH                              0x1
#define _ODCONB_ODCONB6_MASK                                0x40
#define _ODCONB_ODCONB7_POSN                                0x7
#define _ODCONB_ODCONB7_POSITION                            0x7
#define _ODCONB_ODCONB7_SIZE                                0x1
#define _ODCONB_ODCONB7_LENGTH                              0x1
#define _ODCONB_ODCONB7_MASK                                0x80
#define _ODCONB_ODCONB_POSN                                 0x0
#define _ODCONB_ODCONB_POSITION                             0x0
#define _ODCONB_ODCONB_SIZE                                 0x8
#define _ODCONB_ODCONB_LENGTH                               0x8
#define _ODCONB_ODCONB_MASK                                 0xFF

// Register: ODCONC
#define ODCONC ODCONC
extern volatile unsigned char           ODCONC              __at(0x28E);
#ifndef _LIB_BUILD
asm("ODCONC equ 028Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCONC0                :1;
        unsigned ODCONC1                :1;
        unsigned ODCONC2                :1;
        unsigned ODCONC3                :1;
        unsigned ODCONC4                :1;
        unsigned ODCONC5                :1;
        unsigned ODCONC6                :1;
        unsigned ODCONC7                :1;
    };
    struct {
        unsigned ODCONC                 :8;
    };
} ODCONCbits_t;
