MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1788/mcu.h
// Register: PSMC2INT
#define PSMC2INT PSMC2INT
extern volatile unsigned char           PSMC2INT            __at(0xEC0);
#ifndef _LIB_BUILD
asm("PSMC2INT equ 0EC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2TPRIF                :1;
        unsigned P2TDCIF                :1;
        unsigned P2TPHIF                :1;
        unsigned P2TOVIF                :1;
        unsigned P2TPRIE                :1;
        unsigned P2TDCIE                :1;
        unsigned P2TPHIE                :1;
        unsigned P2TOVIE                :1;
    };
} PSMC2INTbits_t;
extern volatile PSMC2INTbits_t PSMC2INTbits __at(0xEC0);
// bitfield macros
#define _PSMC2INT_P2TPRIF_POSN                              0x0
#define _PSMC2INT_P2TPRIF_POSITION                          0x0
#define _PSMC2INT_P2TPRIF_SIZE                              0x1
#define _PSMC2INT_P2TPRIF_LENGTH                            0x1
#define _PSMC2INT_P2TPRIF_MASK                              0x1
#define _PSMC2INT_P2TDCIF_POSN                              0x1
#define _PSMC2INT_P2TDCIF_POSITION                          0x1
#define _PSMC2INT_P2TDCIF_SIZE                              0x1
#define _PSMC2INT_P2TDCIF_LENGTH                            0x1
#define _PSMC2INT_P2TDCIF_MASK                              0x2
#define _PSMC2INT_P2TPHIF_POSN                              0x2
#define _PSMC2INT_P2TPHIF_POSITION                          0x2
#define _PSMC2INT_P2TPHIF_SIZE                              0x1
#define _PSMC2INT_P2TPHIF_LENGTH                            0x1
#define _PSMC2INT_P2TPHIF_MASK                              0x4
#define _PSMC2INT_P2TOVIF_POSN                              0x3
#define _PSMC2INT_P2TOVIF_POSITION                          0x3
#define _PSMC2INT_P2TOVIF_SIZE                              0x1
#define _PSMC2INT_P2TOVIF_LENGTH                            0x1
#define _PSMC2INT_P2TOVIF_MASK                              0x8
#define _PSMC2INT_P2TPRIE_POSN                              0x4
#define _PSMC2INT_P2TPRIE_POSITION                          0x4
#define _PSMC2INT_P2TPRIE_SIZE                              0x1
#define _PSMC2INT_P2TPRIE_LENGTH                            0x1
#define _PSMC2INT_P2TPRIE_MASK                              0x10
#define _PSMC2INT_P2TDCIE_POSN                              0x5
#define _PSMC2INT_P2TDCIE_POSITION                          0x5
#define _PSMC2INT_P2TDCIE_SIZE                              0x1
#define _PSMC2INT_P2TDCIE_LENGTH                            0x1
#define _PSMC2INT_P2TDCIE_MASK                              0x20
#define _PSMC2INT_P2TPHIE_POSN                              0x6
#define _PSMC2INT_P2TPHIE_POSITION                          0x6
#define _PSMC2INT_P2TPHIE_SIZE                              0x1
#define _PSMC2INT_P2TPHIE_LENGTH                            0x1
#define _PSMC2INT_P2TPHIE_MASK                              0x40
#define _PSMC2INT_P2TOVIE_POSN                              0x7
#define _PSMC2INT_P2TOVIE_POSITION                          0x7
#define _PSMC2INT_P2TOVIE_SIZE                              0x1
#define _PSMC2INT_P2TOVIE_LENGTH                            0x1
#define _PSMC2INT_P2TOVIE_MASK                              0x80

// Register: PSMC2PH
#define PSMC2PH PSMC2PH
extern volatile unsigned short          PSMC2PH             __at(0xEC1);
#ifndef _LIB_BUILD
asm("PSMC2PH equ 0EC1h");
#endif

// Register: PSMC2PHL
#define PSMC2PHL PSMC2PHL
extern volatile unsigned char           PSMC2PHL            __at(0xEC1);
#ifndef _LIB_BUILD
asm("PSMC2PHL equ 0EC1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC2PH0               :1;
        unsigned PSMC2PH1               :1;
        unsigned PSMC2PH2               :1;
        unsigned PSMC2PH3               :1;
        unsigned PSMC2PH4               :1;
        unsigned PSMC2PH5               :1;
        unsigned PSMC2PH6               :1;
        unsigned PSMC2PH7               :1;
    };
} PSMC2PHLbits_t;
extern volatile PSMC2PHLbits_t PSMC2PHLbits __at(0xEC1);
// bitfield macros
#define _PSMC2PHL_PSMC2PH0_POSN                             0x0
#define _PSMC2PHL_PSMC2PH0_POSITION                         0x0
#define _PSMC2PHL_PSMC2PH0_SIZE                             0x1
#define _PSMC2PHL_PSMC2PH0_LENGTH                           0x1
#define _PSMC2PHL_PSMC2PH0_MASK                             0x1
#define _PSMC2PHL_PSMC2PH1_POSN                             0x1
#define _PSMC2PHL_PSMC2PH1_POSITION                         0x1
#define _PSMC2PHL_PSMC2PH1_SIZE                             0x1
#define _PSMC2PHL_PSMC2PH1_LENGTH                           0x1
#define _PSMC2PHL_PSMC2PH1_MASK                             0x2
#define _PSMC2PHL_PSMC2PH2_POSN                             0x2
#define _PSMC2PHL_PSMC2PH2_POSITION                         0x2
#define _PSMC2PHL_PSMC2PH2_SIZE                             0x1
#define _PSMC2PHL_PSMC2PH2_LENGTH                           0x1
#define _PSMC2PHL_PSMC2PH2_MASK                             0x4
#define _PSMC2PHL_PSMC2PH3_POSN                             0x3
#define _PSMC2PHL_PSMC2PH3_POSITION                         0x3
#define _PSMC2PHL_PSMC2PH3_SIZE                             0x1
#define _PSMC2PHL_PSMC2PH3_LENGTH                           0x1
#define _PSMC2PHL_PSMC2PH3_MASK                             0x8
#define _PSMC2PHL_PSMC2PH4_POSN                             0x4
#define _PSMC2PHL_PSMC2PH4_POSITION                         0x4
#define _PSMC2PHL_PSMC2PH4_SIZE                             0x1
#define _PSMC2PHL_PSMC2PH4_LENGTH                           0x1
#define _PSMC2PHL_PSMC2PH4_MASK                             0x10
#define _PSMC2PHL_PSMC2PH5_POSN                             0x5
#define _PSMC2PHL_PSMC2PH5_POSITION                         0x5
#define _PSMC2PHL_PSMC2PH5_SIZE                             0x1
#define _PSMC2PHL_PSMC2PH5_LENGTH                           0x1
#define _PSMC2PHL_PSMC2PH5_MASK                             0x20
#define _PSMC2PHL_PSMC2PH6_POSN                             0x6
#define _PSMC2PHL_PSMC2PH6_POSITION                         0x6
#define _PSMC2PHL_PSMC2PH6_SIZE                             0x1
#define _PSMC2PHL_PSMC2PH6_LENGTH                           0x1
#define _PSMC2PHL_PSMC2PH6_MASK                             0x40
#define _PSMC2PHL_PSMC2PH7_POSN                             0x7
#define _PSMC2PHL_PSMC2PH7_POSITION                         0x7
#define _PSMC2PHL_PSMC2PH7_SIZE                             0x1
#define _PSMC2PHL_PSMC2PH7_LENGTH                           0x1
#define _PSMC2PHL_PSMC2PH7_MASK                             0x80

// Register: PSMC2PHH
#define PSMC2PHH PSMC2PHH
extern volatile unsigned char           PSMC2PHH            __at(0xEC2);
#ifndef _LIB_BUILD
asm("PSMC2PHH equ 0EC2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC2PH8               :1;
        unsigned PSMC2PH9               :1;
        unsigned PSMC2PH10              :1;
        unsigned PSMC2PH11              :1;
        unsigned PSMC2PH12              :1;
        unsigned PSMC2PH13              :1;
        unsigned PSMC2PH14              :1;
        unsigned PSMC2PH15              :1;
    };
} PSMC2PHHbits_t;
extern volatile PSMC2PHHbits_t PSMC2PHHbits __at(0xEC2);
// bitfield macros
#define _PSMC2PHH_PSMC2PH8_POSN                             0x0
#define _PSMC2PHH_PSMC2PH8_POSITION                         0x0
#define _PSMC2PHH_PSMC2PH8_SIZE                             0x1
#define _PSMC2PHH_PSMC2PH8_LENGTH                           0x1
#define _PSMC2PHH_PSMC2PH8_MASK                             0x1
#define _PSMC2PHH_PSMC2PH9_POSN                             0x1
#define _PSMC2PHH_PSMC2PH9_POSITION                         0x1
#define _PSMC2PHH_PSMC2PH9_SIZE                             0x1
#define _PSMC2PHH_PSMC2PH9_LENGTH                           0x1
#define _PSMC2PHH_PSMC2PH9_MASK                             0x2
#define _PSMC2PHH_PSMC2PH10_POSN                            0x2
#define _PSMC2PHH_PSMC2PH10_POSITION                        0x2
#define _PSMC2PHH_PSMC2PH10_SIZE                            0x1
#define _PSMC2PHH_PSMC2PH10_LENGTH                          0x1
#define _PSMC2PHH_PSMC2PH10_MASK                            0x4
#define _PSMC2PHH_PSMC2PH11_POSN                            0x3
#define _PSMC2PHH_PSMC2PH11_POSITION                        0x3
#define _PSMC2PHH_PSMC2PH11_SIZE                            0x1
#define _PSMC2PHH_PSMC2PH11_LENGTH                          0x1
#define _PSMC2PHH_PSMC2PH11_MASK                            0x8
#define _PSMC2PHH_PSMC2PH12_POSN                            0x4
#define _PSMC2PHH_PSMC2PH12_POSITION                        0x4
#define _PSMC2PHH_PSMC2PH12_SIZE                            0x1
#define _PSMC2PHH_PSMC2PH12_LENGTH                          0x1
#define _PSMC2PHH_PSMC2PH12_MASK                            0x10
#define _PSMC2PHH_PSMC2PH13_POSN                            0x5
#define _PSMC2PHH_PSMC2PH13_POSITION                        0x5
#define _PSMC2PHH_PSMC2PH13_SIZE                            0x1
#define _PSMC2PHH_PSMC2PH13_LENGTH                          0x1
#define _PSMC2PHH_PSMC2PH13_MASK                            0x20
#define _PSMC2PHH_PSMC2PH14_POSN                            0x6
#define _PSMC2PHH_PSMC2PH14_POSITION                        0x6
#define _PSMC2PHH_PSMC2PH14_SIZE                            0x1
#define _PSMC2PHH_PSMC2PH14_LENGTH                          0x1
#define _PSMC2PHH_PSMC2PH14_MASK                            0x40
#define _PSMC2PHH_PSMC2PH15_POSN                            0x7
#define _PSMC2PHH_PSMC2PH15_POSITION                        0x7
#define _PSMC2PHH_PSMC2PH15_SIZE                            0x1
#define _PSMC2PHH_PSMC2PH15_LENGTH                          0x1
#define _PSMC2PHH_PSMC2PH15_MASK                            0x80

// Register: PSMC2DC
#define PSMC2DC PSMC2DC
extern volatile unsigned short          PSMC2DC             __at(0xEC3);
#ifndef _LIB_BUILD
asm("PSMC2DC equ 0EC3h");
#endif

