MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1788/mcu.h
extern volatile PSMC3STR1bits_t PSMC3STR1bits __at(0xEEF);
// bitfield macros
#define _PSMC3STR1_P3HSMEN_POSN                             0x0
#define _PSMC3STR1_P3HSMEN_POSITION                         0x0
#define _PSMC3STR1_P3HSMEN_SIZE                             0x1
#define _PSMC3STR1_P3HSMEN_LENGTH                           0x1
#define _PSMC3STR1_P3HSMEN_MASK                             0x1
#define _PSMC3STR1_P3LSMEN_POSN                             0x1
#define _PSMC3STR1_P3LSMEN_POSITION                         0x1
#define _PSMC3STR1_P3LSMEN_SIZE                             0x1
#define _PSMC3STR1_P3LSMEN_LENGTH                           0x1
#define _PSMC3STR1_P3LSMEN_MASK                             0x2
#define _PSMC3STR1_P3SSYNC_POSN                             0x7
#define _PSMC3STR1_P3SSYNC_POSITION                         0x7
#define _PSMC3STR1_P3SSYNC_SIZE                             0x1
#define _PSMC3STR1_P3SSYNC_LENGTH                           0x1
#define _PSMC3STR1_P3SSYNC_MASK                             0x80

// Register: PSMC4CON
#define PSMC4CON PSMC4CON
extern volatile unsigned char           PSMC4CON            __at(0xF11);
#ifndef _LIB_BUILD
asm("PSMC4CON equ 0F11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4MODE                 :4;
        unsigned P4DBRE                 :1;
        unsigned P4DBFE                 :1;
        unsigned PSMC4LD                :1;
        unsigned PSMC4EN                :1;
    };
    struct {
        unsigned P4MODE0                :1;
        unsigned P4MODE1                :1;
        unsigned P4MODE2                :1;
        unsigned P4MODE3                :1;
    };
} PSMC4CONbits_t;
extern volatile PSMC4CONbits_t PSMC4CONbits __at(0xF11);
// bitfield macros
#define _PSMC4CON_P4MODE_POSN                               0x0
#define _PSMC4CON_P4MODE_POSITION                           0x0
#define _PSMC4CON_P4MODE_SIZE                               0x4
#define _PSMC4CON_P4MODE_LENGTH                             0x4
#define _PSMC4CON_P4MODE_MASK                               0xF
#define _PSMC4CON_P4DBRE_POSN                               0x4
#define _PSMC4CON_P4DBRE_POSITION                           0x4
#define _PSMC4CON_P4DBRE_SIZE                               0x1
#define _PSMC4CON_P4DBRE_LENGTH                             0x1
#define _PSMC4CON_P4DBRE_MASK                               0x10
#define _PSMC4CON_P4DBFE_POSN                               0x5
#define _PSMC4CON_P4DBFE_POSITION                           0x5
#define _PSMC4CON_P4DBFE_SIZE                               0x1
#define _PSMC4CON_P4DBFE_LENGTH                             0x1
#define _PSMC4CON_P4DBFE_MASK                               0x20
#define _PSMC4CON_PSMC4LD_POSN                              0x6
#define _PSMC4CON_PSMC4LD_POSITION                          0x6
#define _PSMC4CON_PSMC4LD_SIZE                              0x1
#define _PSMC4CON_PSMC4LD_LENGTH                            0x1
#define _PSMC4CON_PSMC4LD_MASK                              0x40
#define _PSMC4CON_PSMC4EN_POSN                              0x7
#define _PSMC4CON_PSMC4EN_POSITION                          0x7
#define _PSMC4CON_PSMC4EN_SIZE                              0x1
#define _PSMC4CON_PSMC4EN_LENGTH                            0x1
#define _PSMC4CON_PSMC4EN_MASK                              0x80
#define _PSMC4CON_P4MODE0_POSN                              0x0
#define _PSMC4CON_P4MODE0_POSITION                          0x0
#define _PSMC4CON_P4MODE0_SIZE                              0x1
#define _PSMC4CON_P4MODE0_LENGTH                            0x1
#define _PSMC4CON_P4MODE0_MASK                              0x1
#define _PSMC4CON_P4MODE1_POSN                              0x1
#define _PSMC4CON_P4MODE1_POSITION                          0x1
#define _PSMC4CON_P4MODE1_SIZE                              0x1
#define _PSMC4CON_P4MODE1_LENGTH                            0x1
#define _PSMC4CON_P4MODE1_MASK                              0x2
#define _PSMC4CON_P4MODE2_POSN                              0x2
#define _PSMC4CON_P4MODE2_POSITION                          0x2
#define _PSMC4CON_P4MODE2_SIZE                              0x1
#define _PSMC4CON_P4MODE2_LENGTH                            0x1
#define _PSMC4CON_P4MODE2_MASK                              0x4
#define _PSMC4CON_P4MODE3_POSN                              0x3
#define _PSMC4CON_P4MODE3_POSITION                          0x3
#define _PSMC4CON_P4MODE3_SIZE                              0x1
#define _PSMC4CON_P4MODE3_LENGTH                            0x1
#define _PSMC4CON_P4MODE3_MASK                              0x8

// Register: PSMC4MDL
#define PSMC4MDL PSMC4MDL
extern volatile unsigned char           PSMC4MDL            __at(0xF12);
#ifndef _LIB_BUILD
asm("PSMC4MDL equ 0F12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4MSRC                 :4;
        unsigned                        :1;
        unsigned P4MDLBIT               :1;
        unsigned P4MDLPOL               :1;
        unsigned P4MDLEN                :1;
    };
    struct {
        unsigned P4MSRC0                :1;
        unsigned P4MSRC1                :1;
        unsigned P4MSRC2                :1;
        unsigned P4MSRC3                :1;
    };
} PSMC4MDLbits_t;
extern volatile PSMC4MDLbits_t PSMC4MDLbits __at(0xF12);
// bitfield macros
#define _PSMC4MDL_P4MSRC_POSN                               0x0
#define _PSMC4MDL_P4MSRC_POSITION                           0x0
#define _PSMC4MDL_P4MSRC_SIZE                               0x4
#define _PSMC4MDL_P4MSRC_LENGTH                             0x4
#define _PSMC4MDL_P4MSRC_MASK                               0xF
#define _PSMC4MDL_P4MDLBIT_POSN                             0x5
#define _PSMC4MDL_P4MDLBIT_POSITION                         0x5
#define _PSMC4MDL_P4MDLBIT_SIZE                             0x1
#define _PSMC4MDL_P4MDLBIT_LENGTH                           0x1
#define _PSMC4MDL_P4MDLBIT_MASK                             0x20
#define _PSMC4MDL_P4MDLPOL_POSN                             0x6
#define _PSMC4MDL_P4MDLPOL_POSITION                         0x6
#define _PSMC4MDL_P4MDLPOL_SIZE                             0x1
#define _PSMC4MDL_P4MDLPOL_LENGTH                           0x1
#define _PSMC4MDL_P4MDLPOL_MASK                             0x40
#define _PSMC4MDL_P4MDLEN_POSN                              0x7
#define _PSMC4MDL_P4MDLEN_POSITION                          0x7
#define _PSMC4MDL_P4MDLEN_SIZE                              0x1
#define _PSMC4MDL_P4MDLEN_LENGTH                            0x1
#define _PSMC4MDL_P4MDLEN_MASK                              0x80
#define _PSMC4MDL_P4MSRC0_POSN                              0x0
#define _PSMC4MDL_P4MSRC0_POSITION                          0x0
#define _PSMC4MDL_P4MSRC0_SIZE                              0x1
#define _PSMC4MDL_P4MSRC0_LENGTH                            0x1
#define _PSMC4MDL_P4MSRC0_MASK                              0x1
#define _PSMC4MDL_P4MSRC1_POSN                              0x1
#define _PSMC4MDL_P4MSRC1_POSITION                          0x1
#define _PSMC4MDL_P4MSRC1_SIZE                              0x1
#define _PSMC4MDL_P4MSRC1_LENGTH                            0x1
#define _PSMC4MDL_P4MSRC1_MASK                              0x2
#define _PSMC4MDL_P4MSRC2_POSN                              0x2
#define _PSMC4MDL_P4MSRC2_POSITION                          0x2
#define _PSMC4MDL_P4MSRC2_SIZE                              0x1
#define _PSMC4MDL_P4MSRC2_LENGTH                            0x1
#define _PSMC4MDL_P4MSRC2_MASK                              0x4
#define _PSMC4MDL_P4MSRC3_POSN                              0x3
#define _PSMC4MDL_P4MSRC3_POSITION                          0x3
#define _PSMC4MDL_P4MSRC3_SIZE                              0x1
#define _PSMC4MDL_P4MSRC3_LENGTH                            0x1
#define _PSMC4MDL_P4MSRC3_MASK                              0x8

// Register: PSMC4SYNC
#define PSMC4SYNC PSMC4SYNC
extern volatile unsigned char           PSMC4SYNC           __at(0xF13);
#ifndef _LIB_BUILD
asm("PSMC4SYNC equ 0F13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4SYNC0                :1;
        unsigned P4SYNC1                :1;
        unsigned P4SYNC2                :1;
        unsigned                        :2;
        unsigned P4DCPOL                :1;
        unsigned P4PRPOL                :1;
        unsigned P4POFST                :1;
    };
} PSMC4SYNCbits_t;
extern volatile PSMC4SYNCbits_t PSMC4SYNCbits __at(0xF13);
// bitfield macros
#define _PSMC4SYNC_P4SYNC0_POSN                             0x0
#define _PSMC4SYNC_P4SYNC0_POSITION                         0x0
#define _PSMC4SYNC_P4SYNC0_SIZE                             0x1
#define _PSMC4SYNC_P4SYNC0_LENGTH                           0x1
#define _PSMC4SYNC_P4SYNC0_MASK                             0x1
#define _PSMC4SYNC_P4SYNC1_POSN                             0x1
#define _PSMC4SYNC_P4SYNC1_POSITION                         0x1
#define _PSMC4SYNC_P4SYNC1_SIZE                             0x1
#define _PSMC4SYNC_P4SYNC1_LENGTH                           0x1
#define _PSMC4SYNC_P4SYNC1_MASK                             0x2
#define _PSMC4SYNC_P4SYNC2_POSN                             0x2
#define _PSMC4SYNC_P4SYNC2_POSITION                         0x2
#define _PSMC4SYNC_P4SYNC2_SIZE                             0x1
#define _PSMC4SYNC_P4SYNC2_LENGTH                           0x1
#define _PSMC4SYNC_P4SYNC2_MASK                             0x4
#define _PSMC4SYNC_P4DCPOL_POSN                             0x5
#define _PSMC4SYNC_P4DCPOL_POSITION                         0x5
#define _PSMC4SYNC_P4DCPOL_SIZE                             0x1
#define _PSMC4SYNC_P4DCPOL_LENGTH                           0x1
#define _PSMC4SYNC_P4DCPOL_MASK                             0x20
#define _PSMC4SYNC_P4PRPOL_POSN                             0x6
#define _PSMC4SYNC_P4PRPOL_POSITION                         0x6
#define _PSMC4SYNC_P4PRPOL_SIZE                             0x1
#define _PSMC4SYNC_P4PRPOL_LENGTH                           0x1
#define _PSMC4SYNC_P4PRPOL_MASK                             0x40
#define _PSMC4SYNC_P4POFST_POSN                             0x7
#define _PSMC4SYNC_P4POFST_POSITION                         0x7
#define _PSMC4SYNC_P4POFST_SIZE                             0x1
#define _PSMC4SYNC_P4POFST_LENGTH                           0x1
#define _PSMC4SYNC_P4POFST_MASK                             0x80

// Register: PSMC4CLK
#define PSMC4CLK PSMC4CLK
extern volatile unsigned char           PSMC4CLK            __at(0xF14);
#ifndef _LIB_BUILD
asm("PSMC4CLK equ 0F14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4CSRC0                :1;
        unsigned P4CSRC1                :1;
        unsigned                        :2;
        unsigned P4CPRE0                :1;
        unsigned P4CPRE1                :1;
    };
    struct {
        unsigned P4CSRC                 :2;
        unsigned                        :2;
        unsigned P4CPRE                 :2;
    };
} PSMC4CLKbits_t;
extern volatile PSMC4CLKbits_t PSMC4CLKbits __at(0xF14);
// bitfield macros
#define _PSMC4CLK_P4CSRC0_POSN                              0x0
#define _PSMC4CLK_P4CSRC0_POSITION                          0x0
#define _PSMC4CLK_P4CSRC0_SIZE                              0x1
#define _PSMC4CLK_P4CSRC0_LENGTH                            0x1
#define _PSMC4CLK_P4CSRC0_MASK                              0x1
#define _PSMC4CLK_P4CSRC1_POSN                              0x1
#define _PSMC4CLK_P4CSRC1_POSITION                          0x1
#define _PSMC4CLK_P4CSRC1_SIZE                              0x1
#define _PSMC4CLK_P4CSRC1_LENGTH                            0x1
#define _PSMC4CLK_P4CSRC1_MASK                              0x2
#define _PSMC4CLK_P4CPRE0_POSN                              0x4
#define _PSMC4CLK_P4CPRE0_POSITION                          0x4
#define _PSMC4CLK_P4CPRE0_SIZE                              0x1
#define _PSMC4CLK_P4CPRE0_LENGTH                            0x1
#define _PSMC4CLK_P4CPRE0_MASK                              0x10
#define _PSMC4CLK_P4CPRE1_POSN                              0x5
#define _PSMC4CLK_P4CPRE1_POSITION                          0x5
#define _PSMC4CLK_P4CPRE1_SIZE                              0x1
#define _PSMC4CLK_P4CPRE1_LENGTH                            0x1
#define _PSMC4CLK_P4CPRE1_MASK                              0x20
#define _PSMC4CLK_P4CSRC_POSN                               0x0
#define _PSMC4CLK_P4CSRC_POSITION                           0x0
#define _PSMC4CLK_P4CSRC_SIZE                               0x2
#define _PSMC4CLK_P4CSRC_LENGTH                             0x2
#define _PSMC4CLK_P4CSRC_MASK                               0x3
#define _PSMC4CLK_P4CPRE_POSN                               0x4
#define _PSMC4CLK_P4CPRE_POSITION                           0x4
#define _PSMC4CLK_P4CPRE_SIZE                               0x2
#define _PSMC4CLK_P4CPRE_LENGTH                             0x2
#define _PSMC4CLK_P4CPRE_MASK                               0x30

// Register: PSMC4OEN
#define PSMC4OEN PSMC4OEN
extern volatile unsigned char           PSMC4OEN            __at(0xF15);
#ifndef _LIB_BUILD
asm("PSMC4OEN equ 0F15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4OEA                  :1;
        unsigned P4OEB                  :1;
    };
} PSMC4OENbits_t;
extern volatile PSMC4OENbits_t PSMC4OENbits __at(0xF15);
// bitfield macros
#define _PSMC4OEN_P4OEA_POSN                                0x0
#define _PSMC4OEN_P4OEA_POSITION                            0x0
#define _PSMC4OEN_P4OEA_SIZE                                0x1
#define _PSMC4OEN_P4OEA_LENGTH                              0x1
#define _PSMC4OEN_P4OEA_MASK                                0x1
#define _PSMC4OEN_P4OEB_POSN                                0x1
#define _PSMC4OEN_P4OEB_POSITION                            0x1
#define _PSMC4OEN_P4OEB_SIZE                                0x1
#define _PSMC4OEN_P4OEB_LENGTH                              0x1
#define _PSMC4OEN_P4OEB_MASK                                0x2

