MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1788/mcu.h
// Register: PSMC4POL
#define PSMC4POL PSMC4POL
extern volatile unsigned char           PSMC4POL            __at(0xF16);
#ifndef _LIB_BUILD
asm("PSMC4POL equ 0F16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4POLA                 :1;
        unsigned P4POLB                 :1;
        unsigned                        :4;
        unsigned P4INPOL                :1;
    };
} PSMC4POLbits_t;
extern volatile PSMC4POLbits_t PSMC4POLbits __at(0xF16);
// bitfield macros
#define _PSMC4POL_P4POLA_POSN                               0x0
#define _PSMC4POL_P4POLA_POSITION                           0x0
#define _PSMC4POL_P4POLA_SIZE                               0x1
#define _PSMC4POL_P4POLA_LENGTH                             0x1
#define _PSMC4POL_P4POLA_MASK                               0x1
#define _PSMC4POL_P4POLB_POSN                               0x1
#define _PSMC4POL_P4POLB_POSITION                           0x1
#define _PSMC4POL_P4POLB_SIZE                               0x1
#define _PSMC4POL_P4POLB_LENGTH                             0x1
#define _PSMC4POL_P4POLB_MASK                               0x2
#define _PSMC4POL_P4INPOL_POSN                              0x6
#define _PSMC4POL_P4INPOL_POSITION                          0x6
#define _PSMC4POL_P4INPOL_SIZE                              0x1
#define _PSMC4POL_P4INPOL_LENGTH                            0x1
#define _PSMC4POL_P4INPOL_MASK                              0x40

// Register: PSMC4BLNK
#define PSMC4BLNK PSMC4BLNK
extern volatile unsigned char           PSMC4BLNK           __at(0xF17);
#ifndef _LIB_BUILD
asm("PSMC4BLNK equ 0F17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4REBM                 :2;
        unsigned                        :2;
        unsigned P4FEBM                 :2;
    };
    struct {
        unsigned P4REBM0                :1;
        unsigned P4REBM1                :1;
        unsigned                        :2;
        unsigned P4FEBM0                :1;
        unsigned P4FEBM1                :1;
    };
} PSMC4BLNKbits_t;
extern volatile PSMC4BLNKbits_t PSMC4BLNKbits __at(0xF17);
// bitfield macros
#define _PSMC4BLNK_P4REBM_POSN                              0x0
#define _PSMC4BLNK_P4REBM_POSITION                          0x0
#define _PSMC4BLNK_P4REBM_SIZE                              0x2
#define _PSMC4BLNK_P4REBM_LENGTH                            0x2
#define _PSMC4BLNK_P4REBM_MASK                              0x3
#define _PSMC4BLNK_P4FEBM_POSN                              0x4
#define _PSMC4BLNK_P4FEBM_POSITION                          0x4
#define _PSMC4BLNK_P4FEBM_SIZE                              0x2
#define _PSMC4BLNK_P4FEBM_LENGTH                            0x2
#define _PSMC4BLNK_P4FEBM_MASK                              0x30
#define _PSMC4BLNK_P4REBM0_POSN                             0x0
#define _PSMC4BLNK_P4REBM0_POSITION                         0x0
#define _PSMC4BLNK_P4REBM0_SIZE                             0x1
#define _PSMC4BLNK_P4REBM0_LENGTH                           0x1
#define _PSMC4BLNK_P4REBM0_MASK                             0x1
#define _PSMC4BLNK_P4REBM1_POSN                             0x1
#define _PSMC4BLNK_P4REBM1_POSITION                         0x1
#define _PSMC4BLNK_P4REBM1_SIZE                             0x1
#define _PSMC4BLNK_P4REBM1_LENGTH                           0x1
#define _PSMC4BLNK_P4REBM1_MASK                             0x2
#define _PSMC4BLNK_P4FEBM0_POSN                             0x4
#define _PSMC4BLNK_P4FEBM0_POSITION                         0x4
#define _PSMC4BLNK_P4FEBM0_SIZE                             0x1
#define _PSMC4BLNK_P4FEBM0_LENGTH                           0x1
#define _PSMC4BLNK_P4FEBM0_MASK                             0x10
#define _PSMC4BLNK_P4FEBM1_POSN                             0x5
#define _PSMC4BLNK_P4FEBM1_POSITION                         0x5
#define _PSMC4BLNK_P4FEBM1_SIZE                             0x1
#define _PSMC4BLNK_P4FEBM1_LENGTH                           0x1
#define _PSMC4BLNK_P4FEBM1_MASK                             0x20

// Register: PSMC4REBS
#define PSMC4REBS PSMC4REBS
extern volatile unsigned char           PSMC4REBS           __at(0xF18);
#ifndef _LIB_BUILD
asm("PSMC4REBS equ 0F18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned P4REBSC1               :1;
        unsigned P4REBSC2               :1;
        unsigned P4REBSC3               :1;
        unsigned P4REBSC4               :1;
        unsigned                        :2;
        unsigned P4REBSIN               :1;
    };
} PSMC4REBSbits_t;
extern volatile PSMC4REBSbits_t PSMC4REBSbits __at(0xF18);
// bitfield macros
#define _PSMC4REBS_P4REBSC1_POSN                            0x1
#define _PSMC4REBS_P4REBSC1_POSITION                        0x1
#define _PSMC4REBS_P4REBSC1_SIZE                            0x1
#define _PSMC4REBS_P4REBSC1_LENGTH                          0x1
#define _PSMC4REBS_P4REBSC1_MASK                            0x2
#define _PSMC4REBS_P4REBSC2_POSN                            0x2
#define _PSMC4REBS_P4REBSC2_POSITION                        0x2
#define _PSMC4REBS_P4REBSC2_SIZE                            0x1
#define _PSMC4REBS_P4REBSC2_LENGTH                          0x1
#define _PSMC4REBS_P4REBSC2_MASK                            0x4
#define _PSMC4REBS_P4REBSC3_POSN                            0x3
#define _PSMC4REBS_P4REBSC3_POSITION                        0x3
#define _PSMC4REBS_P4REBSC3_SIZE                            0x1
#define _PSMC4REBS_P4REBSC3_LENGTH                          0x1
#define _PSMC4REBS_P4REBSC3_MASK                            0x8
#define _PSMC4REBS_P4REBSC4_POSN                            0x4
#define _PSMC4REBS_P4REBSC4_POSITION                        0x4
#define _PSMC4REBS_P4REBSC4_SIZE                            0x1
#define _PSMC4REBS_P4REBSC4_LENGTH                          0x1
#define _PSMC4REBS_P4REBSC4_MASK                            0x10
#define _PSMC4REBS_P4REBSIN_POSN                            0x7
#define _PSMC4REBS_P4REBSIN_POSITION                        0x7
#define _PSMC4REBS_P4REBSIN_SIZE                            0x1
#define _PSMC4REBS_P4REBSIN_LENGTH                          0x1
#define _PSMC4REBS_P4REBSIN_MASK                            0x80

// Register: PSMC4FEBS
#define PSMC4FEBS PSMC4FEBS
extern volatile unsigned char           PSMC4FEBS           __at(0xF19);
#ifndef _LIB_BUILD
asm("PSMC4FEBS equ 0F19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned P4FEBSC1               :1;
        unsigned P4FEBSC2               :1;
        unsigned P4FEBSC3               :1;
        unsigned P4FEBSC4               :1;
        unsigned                        :2;
        unsigned P4FEBSIN               :1;
    };
} PSMC4FEBSbits_t;
