MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1788/mcu.h
// Register: PSMC4DC
#define PSMC4DC PSMC4DC
extern volatile unsigned short          PSMC4DC             __at(0xF23);
#ifndef _LIB_BUILD
asm("PSMC4DC equ 0F23h");
#endif

// Register: PSMC4DCL
#define PSMC4DCL PSMC4DCL
extern volatile unsigned char           PSMC4DCL            __at(0xF23);
#ifndef _LIB_BUILD
asm("PSMC4DCL equ 0F23h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC4DC0               :1;
        unsigned PSMC4DC1               :1;
        unsigned PSMC4DC2               :1;
        unsigned PSMC4DC3               :1;
        unsigned PSMC4DC4               :1;
        unsigned PSMC4DC5               :1;
        unsigned PSMC4DC6               :1;
        unsigned PSMC4DC7               :1;
    };
} PSMC4DCLbits_t;
extern volatile PSMC4DCLbits_t PSMC4DCLbits __at(0xF23);
// bitfield macros
#define _PSMC4DCL_PSMC4DC0_POSN                             0x0
#define _PSMC4DCL_PSMC4DC0_POSITION                         0x0
#define _PSMC4DCL_PSMC4DC0_SIZE                             0x1
#define _PSMC4DCL_PSMC4DC0_LENGTH                           0x1
#define _PSMC4DCL_PSMC4DC0_MASK                             0x1
#define _PSMC4DCL_PSMC4DC1_POSN                             0x1
#define _PSMC4DCL_PSMC4DC1_POSITION                         0x1
#define _PSMC4DCL_PSMC4DC1_SIZE                             0x1
#define _PSMC4DCL_PSMC4DC1_LENGTH                           0x1
#define _PSMC4DCL_PSMC4DC1_MASK                             0x2
#define _PSMC4DCL_PSMC4DC2_POSN                             0x2
#define _PSMC4DCL_PSMC4DC2_POSITION                         0x2
#define _PSMC4DCL_PSMC4DC2_SIZE                             0x1
#define _PSMC4DCL_PSMC4DC2_LENGTH                           0x1
#define _PSMC4DCL_PSMC4DC2_MASK                             0x4
#define _PSMC4DCL_PSMC4DC3_POSN                             0x3
#define _PSMC4DCL_PSMC4DC3_POSITION                         0x3
#define _PSMC4DCL_PSMC4DC3_SIZE                             0x1
#define _PSMC4DCL_PSMC4DC3_LENGTH                           0x1
#define _PSMC4DCL_PSMC4DC3_MASK                             0x8
#define _PSMC4DCL_PSMC4DC4_POSN                             0x4
#define _PSMC4DCL_PSMC4DC4_POSITION                         0x4
#define _PSMC4DCL_PSMC4DC4_SIZE                             0x1
#define _PSMC4DCL_PSMC4DC4_LENGTH                           0x1
#define _PSMC4DCL_PSMC4DC4_MASK                             0x10
#define _PSMC4DCL_PSMC4DC5_POSN                             0x5
#define _PSMC4DCL_PSMC4DC5_POSITION                         0x5
#define _PSMC4DCL_PSMC4DC5_SIZE                             0x1
#define _PSMC4DCL_PSMC4DC5_LENGTH                           0x1
#define _PSMC4DCL_PSMC4DC5_MASK                             0x20
#define _PSMC4DCL_PSMC4DC6_POSN                             0x6
#define _PSMC4DCL_PSMC4DC6_POSITION                         0x6
#define _PSMC4DCL_PSMC4DC6_SIZE                             0x1
#define _PSMC4DCL_PSMC4DC6_LENGTH                           0x1
#define _PSMC4DCL_PSMC4DC6_MASK                             0x40
#define _PSMC4DCL_PSMC4DC7_POSN                             0x7
#define _PSMC4DCL_PSMC4DC7_POSITION                         0x7
#define _PSMC4DCL_PSMC4DC7_SIZE                             0x1
#define _PSMC4DCL_PSMC4DC7_LENGTH                           0x1
#define _PSMC4DCL_PSMC4DC7_MASK                             0x80

// Register: PSMC4DCH
#define PSMC4DCH PSMC4DCH
extern volatile unsigned char           PSMC4DCH            __at(0xF24);
#ifndef _LIB_BUILD
asm("PSMC4DCH equ 0F24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC4DC8               :1;
        unsigned PSMC4DC9               :1;
        unsigned PSMC4DC10              :1;
        unsigned PSMC4DC11              :1;
        unsigned PSMC4DC12              :1;
        unsigned PSMC4DC13              :1;
        unsigned PSMC4DC14              :1;
        unsigned PSMC4DC15              :1;
    };
} PSMC4DCHbits_t;
extern volatile PSMC4DCHbits_t PSMC4DCHbits __at(0xF24);
// bitfield macros
#define _PSMC4DCH_PSMC4DC8_POSN                             0x0
#define _PSMC4DCH_PSMC4DC8_POSITION                         0x0
#define _PSMC4DCH_PSMC4DC8_SIZE                             0x1
#define _PSMC4DCH_PSMC4DC8_LENGTH                           0x1
#define _PSMC4DCH_PSMC4DC8_MASK                             0x1
#define _PSMC4DCH_PSMC4DC9_POSN                             0x1
#define _PSMC4DCH_PSMC4DC9_POSITION                         0x1
#define _PSMC4DCH_PSMC4DC9_SIZE                             0x1
#define _PSMC4DCH_PSMC4DC9_LENGTH                           0x1
#define _PSMC4DCH_PSMC4DC9_MASK                             0x2
#define _PSMC4DCH_PSMC4DC10_POSN                            0x2
#define _PSMC4DCH_PSMC4DC10_POSITION                        0x2
#define _PSMC4DCH_PSMC4DC10_SIZE                            0x1
#define _PSMC4DCH_PSMC4DC10_LENGTH                          0x1
#define _PSMC4DCH_PSMC4DC10_MASK                            0x4
#define _PSMC4DCH_PSMC4DC11_POSN                            0x3
#define _PSMC4DCH_PSMC4DC11_POSITION                        0x3
#define _PSMC4DCH_PSMC4DC11_SIZE                            0x1
#define _PSMC4DCH_PSMC4DC11_LENGTH                          0x1
#define _PSMC4DCH_PSMC4DC11_MASK                            0x8
#define _PSMC4DCH_PSMC4DC12_POSN                            0x4
#define _PSMC4DCH_PSMC4DC12_POSITION                        0x4
#define _PSMC4DCH_PSMC4DC12_SIZE                            0x1
#define _PSMC4DCH_PSMC4DC12_LENGTH                          0x1
#define _PSMC4DCH_PSMC4DC12_MASK                            0x10
#define _PSMC4DCH_PSMC4DC13_POSN                            0x5
#define _PSMC4DCH_PSMC4DC13_POSITION                        0x5
#define _PSMC4DCH_PSMC4DC13_SIZE                            0x1
#define _PSMC4DCH_PSMC4DC13_LENGTH                          0x1
#define _PSMC4DCH_PSMC4DC13_MASK                            0x20
#define _PSMC4DCH_PSMC4DC14_POSN                            0x6
#define _PSMC4DCH_PSMC4DC14_POSITION                        0x6
#define _PSMC4DCH_PSMC4DC14_SIZE                            0x1
#define _PSMC4DCH_PSMC4DC14_LENGTH                          0x1
#define _PSMC4DCH_PSMC4DC14_MASK                            0x40
#define _PSMC4DCH_PSMC4DC15_POSN                            0x7
#define _PSMC4DCH_PSMC4DC15_POSITION                        0x7
#define _PSMC4DCH_PSMC4DC15_SIZE                            0x1
#define _PSMC4DCH_PSMC4DC15_LENGTH                          0x1
#define _PSMC4DCH_PSMC4DC15_MASK                            0x80

// Register: PSMC4PR
#define PSMC4PR PSMC4PR
extern volatile unsigned short          PSMC4PR             __at(0xF25);
#ifndef _LIB_BUILD
asm("PSMC4PR equ 0F25h");
#endif

