MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1788/mcu.h
// Register: PSMC4BLKF
#define PSMC4BLKF PSMC4BLKF
extern volatile unsigned char           PSMC4BLKF           __at(0xF2C);
#ifndef _LIB_BUILD
asm("PSMC4BLKF equ 0F2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC4BLKF0             :1;
        unsigned PSMC4BLKF1             :1;
        unsigned PSMC4BLKF2             :1;
        unsigned PSMC4BLKF3             :1;
        unsigned PSMC4BLKF4             :1;
        unsigned PSMC4BLKF5             :1;
        unsigned PSMC4BLKF6             :1;
        unsigned PSMC4BLKF7             :1;
    };
} PSMC4BLKFbits_t;
extern volatile PSMC4BLKFbits_t PSMC4BLKFbits __at(0xF2C);
// bitfield macros
#define _PSMC4BLKF_PSMC4BLKF0_POSN                          0x0
#define _PSMC4BLKF_PSMC4BLKF0_POSITION                      0x0
#define _PSMC4BLKF_PSMC4BLKF0_SIZE                          0x1
#define _PSMC4BLKF_PSMC4BLKF0_LENGTH                        0x1
#define _PSMC4BLKF_PSMC4BLKF0_MASK                          0x1
#define _PSMC4BLKF_PSMC4BLKF1_POSN                          0x1
#define _PSMC4BLKF_PSMC4BLKF1_POSITION                      0x1
#define _PSMC4BLKF_PSMC4BLKF1_SIZE                          0x1
#define _PSMC4BLKF_PSMC4BLKF1_LENGTH                        0x1
#define _PSMC4BLKF_PSMC4BLKF1_MASK                          0x2
#define _PSMC4BLKF_PSMC4BLKF2_POSN                          0x2
#define _PSMC4BLKF_PSMC4BLKF2_POSITION                      0x2
#define _PSMC4BLKF_PSMC4BLKF2_SIZE                          0x1
#define _PSMC4BLKF_PSMC4BLKF2_LENGTH                        0x1
#define _PSMC4BLKF_PSMC4BLKF2_MASK                          0x4
#define _PSMC4BLKF_PSMC4BLKF3_POSN                          0x3
#define _PSMC4BLKF_PSMC4BLKF3_POSITION                      0x3
#define _PSMC4BLKF_PSMC4BLKF3_SIZE                          0x1
#define _PSMC4BLKF_PSMC4BLKF3_LENGTH                        0x1
#define _PSMC4BLKF_PSMC4BLKF3_MASK                          0x8
#define _PSMC4BLKF_PSMC4BLKF4_POSN                          0x4
#define _PSMC4BLKF_PSMC4BLKF4_POSITION                      0x4
#define _PSMC4BLKF_PSMC4BLKF4_SIZE                          0x1
#define _PSMC4BLKF_PSMC4BLKF4_LENGTH                        0x1
#define _PSMC4BLKF_PSMC4BLKF4_MASK                          0x10
#define _PSMC4BLKF_PSMC4BLKF5_POSN                          0x5
#define _PSMC4BLKF_PSMC4BLKF5_POSITION                      0x5
#define _PSMC4BLKF_PSMC4BLKF5_SIZE                          0x1
#define _PSMC4BLKF_PSMC4BLKF5_LENGTH                        0x1
#define _PSMC4BLKF_PSMC4BLKF5_MASK                          0x20
#define _PSMC4BLKF_PSMC4BLKF6_POSN                          0x6
#define _PSMC4BLKF_PSMC4BLKF6_POSITION                      0x6
#define _PSMC4BLKF_PSMC4BLKF6_SIZE                          0x1
#define _PSMC4BLKF_PSMC4BLKF6_LENGTH                        0x1
#define _PSMC4BLKF_PSMC4BLKF6_MASK                          0x40
#define _PSMC4BLKF_PSMC4BLKF7_POSN                          0x7
#define _PSMC4BLKF_PSMC4BLKF7_POSITION                      0x7
#define _PSMC4BLKF_PSMC4BLKF7_SIZE                          0x1
#define _PSMC4BLKF_PSMC4BLKF7_LENGTH                        0x1
#define _PSMC4BLKF_PSMC4BLKF7_MASK                          0x80

// Register: PSMC4FFA
#define PSMC4FFA PSMC4FFA
extern volatile unsigned char           PSMC4FFA            __at(0xF2D);
#ifndef _LIB_BUILD
asm("PSMC4FFA equ 0F2Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC4FFA0              :1;
        unsigned PSMC4FFA1              :1;
        unsigned PSMC4FFA2              :1;
        unsigned PSMC4FFA3              :1;
    };
} PSMC4FFAbits_t;
extern volatile PSMC4FFAbits_t PSMC4FFAbits __at(0xF2D);
// bitfield macros
#define _PSMC4FFA_PSMC4FFA0_POSN                            0x0
#define _PSMC4FFA_PSMC4FFA0_POSITION                        0x0
#define _PSMC4FFA_PSMC4FFA0_SIZE                            0x1
#define _PSMC4FFA_PSMC4FFA0_LENGTH                          0x1
#define _PSMC4FFA_PSMC4FFA0_MASK                            0x1
#define _PSMC4FFA_PSMC4FFA1_POSN                            0x1
#define _PSMC4FFA_PSMC4FFA1_POSITION                        0x1
#define _PSMC4FFA_PSMC4FFA1_SIZE                            0x1
#define _PSMC4FFA_PSMC4FFA1_LENGTH                          0x1
#define _PSMC4FFA_PSMC4FFA1_MASK                            0x2
#define _PSMC4FFA_PSMC4FFA2_POSN                            0x2
#define _PSMC4FFA_PSMC4FFA2_POSITION                        0x2
#define _PSMC4FFA_PSMC4FFA2_SIZE                            0x1
#define _PSMC4FFA_PSMC4FFA2_LENGTH                          0x1
#define _PSMC4FFA_PSMC4FFA2_MASK                            0x4
#define _PSMC4FFA_PSMC4FFA3_POSN                            0x3
#define _PSMC4FFA_PSMC4FFA3_POSITION                        0x3
#define _PSMC4FFA_PSMC4FFA3_SIZE                            0x1
#define _PSMC4FFA_PSMC4FFA3_LENGTH                          0x1
#define _PSMC4FFA_PSMC4FFA3_MASK                            0x8

// Register: PSMC4STR0
#define PSMC4STR0 PSMC4STR0
extern volatile unsigned char           PSMC4STR0           __at(0xF2E);
#ifndef _LIB_BUILD
asm("PSMC4STR0 equ 0F2Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4STRA                 :1;
        unsigned P4STRB                 :1;
    };
} PSMC4STR0bits_t;
extern volatile PSMC4STR0bits_t PSMC4STR0bits __at(0xF2E);
// bitfield macros
#define _PSMC4STR0_P4STRA_POSN                              0x0
#define _PSMC4STR0_P4STRA_POSITION                          0x0
#define _PSMC4STR0_P4STRA_SIZE                              0x1
#define _PSMC4STR0_P4STRA_LENGTH                            0x1
#define _PSMC4STR0_P4STRA_MASK                              0x1
#define _PSMC4STR0_P4STRB_POSN                              0x1
#define _PSMC4STR0_P4STRB_POSITION                          0x1
#define _PSMC4STR0_P4STRB_SIZE                              0x1
#define _PSMC4STR0_P4STRB_LENGTH                            0x1
#define _PSMC4STR0_P4STRB_MASK                              0x2

// Register: PSMC4STR1
#define PSMC4STR1 PSMC4STR1
extern volatile unsigned char           PSMC4STR1           __at(0xF2F);
#ifndef _LIB_BUILD
asm("PSMC4STR1 equ 0F2Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P4HSMEN                :1;
        unsigned P4LSMEN                :1;
        unsigned                        :5;
        unsigned P4SSYNC                :1;
    };
} PSMC4STR1bits_t;
extern volatile PSMC4STR1bits_t PSMC4STR1bits __at(0xF2F);
// bitfield macros
#define _PSMC4STR1_P4HSMEN_POSN                             0x0
#define _PSMC4STR1_P4HSMEN_POSITION                         0x0
#define _PSMC4STR1_P4HSMEN_SIZE                             0x1
#define _PSMC4STR1_P4HSMEN_LENGTH                           0x1
#define _PSMC4STR1_P4HSMEN_MASK                             0x1
#define _PSMC4STR1_P4LSMEN_POSN                             0x1
#define _PSMC4STR1_P4LSMEN_POSITION                         0x1
#define _PSMC4STR1_P4LSMEN_SIZE                             0x1
#define _PSMC4STR1_P4LSMEN_LENGTH                           0x1
#define _PSMC4STR1_P4LSMEN_MASK                             0x2
#define _PSMC4STR1_P4SSYNC_POSN                             0x7
#define _PSMC4STR1_P4SSYNC_POSITION                         0x7
#define _PSMC4STR1_P4SSYNC_SIZE                             0x1
#define _PSMC4STR1_P4SSYNC_LENGTH                           0x1
#define _PSMC4STR1_P4SSYNC_MASK                             0x80

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
extern volatile unsigned char           STATUS_SHAD         __at(0xFE4);
#ifndef _LIB_BUILD
asm("STATUS_SHAD equ 0FE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C_SHAD                 :1;
        unsigned DC_SHAD                :1;
        unsigned Z_SHAD                 :1;
    };
} STATUS_SHADbits_t;
extern volatile STATUS_SHADbits_t STATUS_SHADbits __at(0xFE4);
// bitfield macros
#define _STATUS_SHAD_C_SHAD_POSN                            0x0
#define _STATUS_SHAD_C_SHAD_POSITION                        0x0
#define _STATUS_SHAD_C_SHAD_SIZE                            0x1
#define _STATUS_SHAD_C_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_C_SHAD_MASK                            0x1
#define _STATUS_SHAD_DC_SHAD_POSN                           0x1
#define _STATUS_SHAD_DC_SHAD_POSITION                       0x1
#define _STATUS_SHAD_DC_SHAD_SIZE                           0x1
#define _STATUS_SHAD_DC_SHAD_LENGTH                         0x1
#define _STATUS_SHAD_DC_SHAD_MASK                           0x2
#define _STATUS_SHAD_Z_SHAD_POSN                            0x2
#define _STATUS_SHAD_Z_SHAD_POSITION                        0x2
#define _STATUS_SHAD_Z_SHAD_SIZE                            0x1
#define _STATUS_SHAD_Z_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_Z_SHAD_MASK                            0x4

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
extern volatile unsigned char           WREG_SHAD           __at(0xFE5);
#ifndef _LIB_BUILD
asm("WREG_SHAD equ 0FE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG_SHAD              :8;
    };
} WREG_SHADbits_t;
