MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1788/mcu.h
// PSMC1OEN<P1OEB>
extern volatile __bit                   P1OEB               __at(0x74A9);	// @ (0xE95 * 8 + 1)
#define                                 P1OEB_bit           _BIT_ACCESS(PSMC1OEN,1)
// PSMC1OEN<P1OEC>
extern volatile __bit                   P1OEC               __at(0x74AA);	// @ (0xE95 * 8 + 2)
#define                                 P1OEC_bit           _BIT_ACCESS(PSMC1OEN,2)
// PSMC1OEN<P1OED>
extern volatile __bit                   P1OED               __at(0x74AB);	// @ (0xE95 * 8 + 3)
#define                                 P1OED_bit           _BIT_ACCESS(PSMC1OEN,3)
// PSMC1OEN<P1OEE>
extern volatile __bit                   P1OEE               __at(0x74AC);	// @ (0xE95 * 8 + 4)
#define                                 P1OEE_bit           _BIT_ACCESS(PSMC1OEN,4)
// PSMC1OEN<P1OEF>
extern volatile __bit                   P1OEF               __at(0x74AD);	// @ (0xE95 * 8 + 5)
#define                                 P1OEF_bit           _BIT_ACCESS(PSMC1OEN,5)
// PSMC1PHS<P1PHSC1>
extern volatile __bit                   P1PHSC1             __at(0x74D1);	// @ (0xE9A * 8 + 1)
#define                                 P1PHSC1_bit         _BIT_ACCESS(PSMC1PHS,1)
// PSMC1PHS<P1PHSC2>
extern volatile __bit                   P1PHSC2             __at(0x74D2);	// @ (0xE9A * 8 + 2)
#define                                 P1PHSC2_bit         _BIT_ACCESS(PSMC1PHS,2)
// PSMC1PHS<P1PHSC3>
extern volatile __bit                   P1PHSC3             __at(0x74D3);	// @ (0xE9A * 8 + 3)
#define                                 P1PHSC3_bit         _BIT_ACCESS(PSMC1PHS,3)
// PSMC1PHS<P1PHSC4>
extern volatile __bit                   P1PHSC4             __at(0x74D4);	// @ (0xE9A * 8 + 4)
#define                                 P1PHSC4_bit         _BIT_ACCESS(PSMC1PHS,4)
// PSMC1PHS<P1PHSIN>
extern volatile __bit                   P1PHSIN             __at(0x74D7);	// @ (0xE9A * 8 + 7)
#define                                 P1PHSIN_bit         _BIT_ACCESS(PSMC1PHS,7)
// PSMC1PHS<P1PHST>
extern volatile __bit                   P1PHST              __at(0x74D0);	// @ (0xE9A * 8 + 0)
#define                                 P1PHST_bit          _BIT_ACCESS(PSMC1PHS,0)
// PSMC1SYNC<P1POFST>
extern volatile __bit                   P1POFST             __at(0x749F);	// @ (0xE93 * 8 + 7)
#define                                 P1POFST_bit         _BIT_ACCESS(PSMC1SYNC,7)
// PSMC1POL<P1POLA>
extern volatile __bit                   P1POLA              __at(0x74B0);	// @ (0xE96 * 8 + 0)
#define                                 P1POLA_bit          _BIT_ACCESS(PSMC1POL,0)
// PSMC1POL<P1POLB>
extern volatile __bit                   P1POLB              __at(0x74B1);	// @ (0xE96 * 8 + 1)
#define                                 P1POLB_bit          _BIT_ACCESS(PSMC1POL,1)
// PSMC1POL<P1POLC>
extern volatile __bit                   P1POLC              __at(0x74B2);	// @ (0xE96 * 8 + 2)
#define                                 P1POLC_bit          _BIT_ACCESS(PSMC1POL,2)
// PSMC1POL<P1POLD>
extern volatile __bit                   P1POLD              __at(0x74B3);	// @ (0xE96 * 8 + 3)
#define                                 P1POLD_bit          _BIT_ACCESS(PSMC1POL,3)
// PSMC1POL<P1POLE>
extern volatile __bit                   P1POLE              __at(0x74B4);	// @ (0xE96 * 8 + 4)
#define                                 P1POLE_bit          _BIT_ACCESS(PSMC1POL,4)
// PSMC1POL<P1POLF>
extern volatile __bit                   P1POLF              __at(0x74B5);	// @ (0xE96 * 8 + 5)
#define                                 P1POLF_bit          _BIT_ACCESS(PSMC1POL,5)
// PSMC1SYNC<P1PRPOL>
extern volatile __bit                   P1PRPOL             __at(0x749E);	// @ (0xE93 * 8 + 6)
#define                                 P1PRPOL_bit         _BIT_ACCESS(PSMC1SYNC,6)
// PSMC1PRS<P1PRSC1>
extern volatile __bit                   P1PRSC1             __at(0x74E1);	// @ (0xE9C * 8 + 1)
#define                                 P1PRSC1_bit         _BIT_ACCESS(PSMC1PRS,1)
// PSMC1PRS<P1PRSC2>
extern volatile __bit                   P1PRSC2             __at(0x74E2);	// @ (0xE9C * 8 + 2)
#define                                 P1PRSC2_bit         _BIT_ACCESS(PSMC1PRS,2)
// PSMC1PRS<P1PRSC3>
extern volatile __bit                   P1PRSC3             __at(0x74E3);	// @ (0xE9C * 8 + 3)
#define                                 P1PRSC3_bit         _BIT_ACCESS(PSMC1PRS,3)
// PSMC1PRS<P1PRSC4>
extern volatile __bit                   P1PRSC4             __at(0x74E4);	// @ (0xE9C * 8 + 4)
#define                                 P1PRSC4_bit         _BIT_ACCESS(PSMC1PRS,4)
// PSMC1PRS<P1PRSIN>
extern volatile __bit                   P1PRSIN             __at(0x74E7);	// @ (0xE9C * 8 + 7)
#define                                 P1PRSIN_bit         _BIT_ACCESS(PSMC1PRS,7)
// PSMC1PRS<P1PRST>
extern volatile __bit                   P1PRST              __at(0x74E0);	// @ (0xE9C * 8 + 0)
#define                                 P1PRST_bit          _BIT_ACCESS(PSMC1PRS,0)
// PSMC1BLNK<P1REBM0>
extern volatile __bit                   P1REBM0             __at(0x74B8);	// @ (0xE97 * 8 + 0)
#define                                 P1REBM0_bit         _BIT_ACCESS(PSMC1BLNK,0)
// PSMC1BLNK<P1REBM1>
extern volatile __bit                   P1REBM1             __at(0x74B9);	// @ (0xE97 * 8 + 1)
#define                                 P1REBM1_bit         _BIT_ACCESS(PSMC1BLNK,1)
// PSMC1REBS<P1REBSC1>
extern volatile __bit                   P1REBSC1            __at(0x74C1);	// @ (0xE98 * 8 + 1)
#define                                 P1REBSC1_bit        _BIT_ACCESS(PSMC1REBS,1)
// PSMC1REBS<P1REBSC2>
extern volatile __bit                   P1REBSC2            __at(0x74C2);	// @ (0xE98 * 8 + 2)
#define                                 P1REBSC2_bit        _BIT_ACCESS(PSMC1REBS,2)
// PSMC1REBS<P1REBSC3>
extern volatile __bit                   P1REBSC3            __at(0x74C3);	// @ (0xE98 * 8 + 3)
#define                                 P1REBSC3_bit        _BIT_ACCESS(PSMC1REBS,3)
// PSMC1REBS<P1REBSC4>
extern volatile __bit                   P1REBSC4            __at(0x74C4);	// @ (0xE98 * 8 + 4)
#define                                 P1REBSC4_bit        _BIT_ACCESS(PSMC1REBS,4)
// PSMC1REBS<P1REBSIN>
extern volatile __bit                   P1REBSIN            __at(0x74C7);	// @ (0xE98 * 8 + 7)
#define                                 P1REBSIN_bit        _BIT_ACCESS(PSMC1REBS,7)
// PSMC1STR1<P1SSYNC>
extern volatile __bit                   P1SSYNC             __at(0x757F);	// @ (0xEAF * 8 + 7)
#define                                 P1SSYNC_bit         _BIT_ACCESS(PSMC1STR1,7)
// PSMC1STR0<P1STRA>
extern volatile __bit                   P1STRA              __at(0x7570);	// @ (0xEAE * 8 + 0)
#define                                 P1STRA_bit          _BIT_ACCESS(PSMC1STR0,0)
// PSMC1STR0<P1STRB>
extern volatile __bit                   P1STRB              __at(0x7571);	// @ (0xEAE * 8 + 1)
#define                                 P1STRB_bit          _BIT_ACCESS(PSMC1STR0,1)
// PSMC1STR0<P1STRC>
extern volatile __bit                   P1STRC              __at(0x7572);	// @ (0xEAE * 8 + 2)
#define                                 P1STRC_bit          _BIT_ACCESS(PSMC1STR0,2)
// PSMC1STR0<P1STRD>
extern volatile __bit                   P1STRD              __at(0x7573);	// @ (0xEAE * 8 + 3)
#define                                 P1STRD_bit          _BIT_ACCESS(PSMC1STR0,3)
// PSMC1STR0<P1STRE>
extern volatile __bit                   P1STRE              __at(0x7574);	// @ (0xEAE * 8 + 4)
#define                                 P1STRE_bit          _BIT_ACCESS(PSMC1STR0,4)
// PSMC1STR0<P1STRF>
extern volatile __bit                   P1STRF              __at(0x7575);	// @ (0xEAE * 8 + 5)
#define                                 P1STRF_bit          _BIT_ACCESS(PSMC1STR0,5)
// PSMC1SYNC<P1SYNC0>
extern volatile __bit                   P1SYNC0             __at(0x7498);	// @ (0xE93 * 8 + 0)
#define                                 P1SYNC0_bit         _BIT_ACCESS(PSMC1SYNC,0)
// PSMC1SYNC<P1SYNC1>
extern volatile __bit                   P1SYNC1             __at(0x7499);	// @ (0xE93 * 8 + 1)
#define                                 P1SYNC1_bit         _BIT_ACCESS(PSMC1SYNC,1)
// PSMC1SYNC<P1SYNC2>
extern volatile __bit                   P1SYNC2             __at(0x749A);	// @ (0xE93 * 8 + 2)
#define                                 P1SYNC2_bit         _BIT_ACCESS(PSMC1SYNC,2)
// PSMC1INT<P1TDCIE>
extern volatile __bit                   P1TDCIE             __at(0x7505);	// @ (0xEA0 * 8 + 5)
#define                                 P1TDCIE_bit         _BIT_ACCESS(PSMC1INT,5)
// PSMC1INT<P1TDCIF>
extern volatile __bit                   P1TDCIF             __at(0x7501);	// @ (0xEA0 * 8 + 1)
#define                                 P1TDCIF_bit         _BIT_ACCESS(PSMC1INT,1)
// PSMC1INT<P1TOVIE>
extern volatile __bit                   P1TOVIE             __at(0x7507);	// @ (0xEA0 * 8 + 7)
#define                                 P1TOVIE_bit         _BIT_ACCESS(PSMC1INT,7)
// PSMC1INT<P1TOVIF>
extern volatile __bit                   P1TOVIF             __at(0x7503);	// @ (0xEA0 * 8 + 3)
#define                                 P1TOVIF_bit         _BIT_ACCESS(PSMC1INT,3)
// PSMC1INT<P1TPHIE>
extern volatile __bit                   P1TPHIE             __at(0x7506);	// @ (0xEA0 * 8 + 6)
#define                                 P1TPHIE_bit         _BIT_ACCESS(PSMC1INT,6)
// PSMC1INT<P1TPHIF>
extern volatile __bit                   P1TPHIF             __at(0x7502);	// @ (0xEA0 * 8 + 2)
#define                                 P1TPHIF_bit         _BIT_ACCESS(PSMC1INT,2)
// PSMC1INT<P1TPRIE>
extern volatile __bit                   P1TPRIE             __at(0x7504);	// @ (0xEA0 * 8 + 4)
#define                                 P1TPRIE_bit         _BIT_ACCESS(PSMC1INT,4)
// PSMC1INT<P1TPRIF>
extern volatile __bit                   P1TPRIF             __at(0x7500);	// @ (0xEA0 * 8 + 0)
#define                                 P1TPRIF_bit         _BIT_ACCESS(PSMC1INT,0)
// PSMC2ASDC<P2ARSEN>
extern volatile __bit                   P2ARSEN             __at(0x75ED);	// @ (0xEBD * 8 + 5)
#define                                 P2ARSEN_bit         _BIT_ACCESS(PSMC2ASDC,5)
// PSMC2ASDC<P2ASDEN>
extern volatile __bit                   P2ASDEN             __at(0x75EE);	// @ (0xEBD * 8 + 6)
#define                                 P2ASDEN_bit         _BIT_ACCESS(PSMC2ASDC,6)
// PSMC2ASDL<P2ASDLA>
extern volatile __bit                   P2ASDLA             __at(0x75F0);	// @ (0xEBE * 8 + 0)
#define                                 P2ASDLA_bit         _BIT_ACCESS(PSMC2ASDL,0)
// PSMC2ASDL<P2ASDLB>
extern volatile __bit                   P2ASDLB             __at(0x75F1);	// @ (0xEBE * 8 + 1)
#define                                 P2ASDLB_bit         _BIT_ACCESS(PSMC2ASDL,1)
// PSMC2ASDC<P2ASDOV>
extern volatile __bit                   P2ASDOV             __at(0x75E8);	// @ (0xEBD * 8 + 0)
#define                                 P2ASDOV_bit         _BIT_ACCESS(PSMC2ASDC,0)
// PSMC2ASDS<P2ASDSC1>
extern volatile __bit                   P2ASDSC1            __at(0x75F9);	// @ (0xEBF * 8 + 1)
#define                                 P2ASDSC1_bit        _BIT_ACCESS(PSMC2ASDS,1)
// PSMC2ASDS<P2ASDSC2>
extern volatile __bit                   P2ASDSC2            __at(0x75FA);	// @ (0xEBF * 8 + 2)
#define                                 P2ASDSC2_bit        _BIT_ACCESS(PSMC2ASDS,2)
// PSMC2ASDS<P2ASDSC3>
extern volatile __bit                   P2ASDSC3            __at(0x75FB);	// @ (0xEBF * 8 + 3)
#define                                 P2ASDSC3_bit        _BIT_ACCESS(PSMC2ASDS,3)
// PSMC2ASDS<P2ASDSC4>
extern volatile __bit                   P2ASDSC4            __at(0x75FC);	// @ (0xEBF * 8 + 4)
#define                                 P2ASDSC4_bit        _BIT_ACCESS(PSMC2ASDS,4)
// PSMC2ASDS<P2ASDSIN>
extern volatile __bit                   P2ASDSIN            __at(0x75FF);	// @ (0xEBF * 8 + 7)
#define                                 P2ASDSIN_bit        _BIT_ACCESS(PSMC2ASDS,7)
// PSMC2ASDC<P2ASE>
extern volatile __bit                   P2ASE               __at(0x75EF);	// @ (0xEBD * 8 + 7)
#define                                 P2ASE_bit           _BIT_ACCESS(PSMC2ASDC,7)
// PSMC2CLK<P2CPRE0>
extern volatile __bit                   P2CPRE0             __at(0x75A4);	// @ (0xEB4 * 8 + 4)
#define                                 P2CPRE0_bit         _BIT_ACCESS(PSMC2CLK,4)
// PSMC2CLK<P2CPRE1>
extern volatile __bit                   P2CPRE1             __at(0x75A5);	// @ (0xEB4 * 8 + 5)
#define                                 P2CPRE1_bit         _BIT_ACCESS(PSMC2CLK,5)
// PSMC2CLK<P2CSRC0>
extern volatile __bit                   P2CSRC0             __at(0x75A0);	// @ (0xEB4 * 8 + 0)
#define                                 P2CSRC0_bit         _BIT_ACCESS(PSMC2CLK,0)
// PSMC2CLK<P2CSRC1>
extern volatile __bit                   P2CSRC1             __at(0x75A1);	// @ (0xEB4 * 8 + 1)
#define                                 P2CSRC1_bit         _BIT_ACCESS(PSMC2CLK,1)
// PSMC2CON<P2DBFE>
extern volatile __bit                   P2DBFE              __at(0x758D);	// @ (0xEB1 * 8 + 5)
#define                                 P2DBFE_bit          _BIT_ACCESS(PSMC2CON,5)
// PSMC2CON<P2DBRE>
extern volatile __bit                   P2DBRE              __at(0x758C);	// @ (0xEB1 * 8 + 4)
#define                                 P2DBRE_bit          _BIT_ACCESS(PSMC2CON,4)
// PSMC2SYNC<P2DCPOL>
extern volatile __bit                   P2DCPOL             __at(0x759D);	// @ (0xEB3 * 8 + 5)
#define                                 P2DCPOL_bit         _BIT_ACCESS(PSMC2SYNC,5)
// PSMC2DCS<P2DCSC1>
extern volatile __bit                   P2DCSC1             __at(0x75D9);	// @ (0xEBB * 8 + 1)
#define                                 P2DCSC1_bit         _BIT_ACCESS(PSMC2DCS,1)
// PSMC2DCS<P2DCSC2>
extern volatile __bit                   P2DCSC2             __at(0x75DA);	// @ (0xEBB * 8 + 2)
#define                                 P2DCSC2_bit         _BIT_ACCESS(PSMC2DCS,2)
// PSMC2DCS<P2DCSC3>
extern volatile __bit                   P2DCSC3             __at(0x75DB);	// @ (0xEBB * 8 + 3)
#define                                 P2DCSC3_bit         _BIT_ACCESS(PSMC2DCS,3)
// PSMC2DCS<P2DCSC4>
extern volatile __bit                   P2DCSC4             __at(0x75DC);	// @ (0xEBB * 8 + 4)
#define                                 P2DCSC4_bit         _BIT_ACCESS(PSMC2DCS,4)
// PSMC2DCS<P2DCSIN>
extern volatile __bit                   P2DCSIN             __at(0x75DF);	// @ (0xEBB * 8 + 7)
#define                                 P2DCSIN_bit         _BIT_ACCESS(PSMC2DCS,7)
// PSMC2DCS<P2DCST>
extern volatile __bit                   P2DCST              __at(0x75D8);	// @ (0xEBB * 8 + 0)
#define                                 P2DCST_bit          _BIT_ACCESS(PSMC2DCS,0)
// PSMC2BLNK<P2FEBM0>
extern volatile __bit                   P2FEBM0             __at(0x75BC);	// @ (0xEB7 * 8 + 4)
#define                                 P2FEBM0_bit         _BIT_ACCESS(PSMC2BLNK,4)
// PSMC2BLNK<P2FEBM1>
extern volatile __bit                   P2FEBM1             __at(0x75BD);	// @ (0xEB7 * 8 + 5)
#define                                 P2FEBM1_bit         _BIT_ACCESS(PSMC2BLNK,5)
// PSMC2FEBS<P2FEBSC1>
extern volatile __bit                   P2FEBSC1            __at(0x75C9);	// @ (0xEB9 * 8 + 1)
#define                                 P2FEBSC1_bit        _BIT_ACCESS(PSMC2FEBS,1)
// PSMC2FEBS<P2FEBSC2>
extern volatile __bit                   P2FEBSC2            __at(0x75CA);	// @ (0xEB9 * 8 + 2)
#define                                 P2FEBSC2_bit        _BIT_ACCESS(PSMC2FEBS,2)
// PSMC2FEBS<P2FEBSC3>
extern volatile __bit                   P2FEBSC3            __at(0x75CB);	// @ (0xEB9 * 8 + 3)
#define                                 P2FEBSC3_bit        _BIT_ACCESS(PSMC2FEBS,3)
// PSMC2FEBS<P2FEBSC4>
extern volatile __bit                   P2FEBSC4            __at(0x75CC);	// @ (0xEB9 * 8 + 4)
#define                                 P2FEBSC4_bit        _BIT_ACCESS(PSMC2FEBS,4)
// PSMC2FEBS<P2FEBSIN>
extern volatile __bit                   P2FEBSIN            __at(0x75CF);	// @ (0xEB9 * 8 + 7)
#define                                 P2FEBSIN_bit        _BIT_ACCESS(PSMC2FEBS,7)
// PSMC2STR1<P2HSMEN>
extern volatile __bit                   P2HSMEN             __at(0x7678);	// @ (0xECF * 8 + 0)
#define                                 P2HSMEN_bit         _BIT_ACCESS(PSMC2STR1,0)
// PSMC2POL<P2INPOL>
extern volatile __bit                   P2INPOL             __at(0x75B6);	// @ (0xEB6 * 8 + 6)
#define                                 P2INPOL_bit         _BIT_ACCESS(PSMC2POL,6)
// PSMC2STR1<P2LSMEN>
extern volatile __bit                   P2LSMEN             __at(0x7679);	// @ (0xECF * 8 + 1)
#define                                 P2LSMEN_bit         _BIT_ACCESS(PSMC2STR1,1)
// PSMC2MDL<P2MDLBIT>
extern volatile __bit                   P2MDLBIT            __at(0x7595);	// @ (0xEB2 * 8 + 5)
#define                                 P2MDLBIT_bit        _BIT_ACCESS(PSMC2MDL,5)
// PSMC2MDL<P2MDLEN>
extern volatile __bit                   P2MDLEN             __at(0x7597);	// @ (0xEB2 * 8 + 7)
#define                                 P2MDLEN_bit         _BIT_ACCESS(PSMC2MDL,7)
// PSMC2MDL<P2MDLPOL>
extern volatile __bit                   P2MDLPOL            __at(0x7596);	// @ (0xEB2 * 8 + 6)
#define                                 P2MDLPOL_bit        _BIT_ACCESS(PSMC2MDL,6)
// PSMC2CON<P2MODE0>
extern volatile __bit                   P2MODE0             __at(0x7588);	// @ (0xEB1 * 8 + 0)
#define                                 P2MODE0_bit         _BIT_ACCESS(PSMC2CON,0)
// PSMC2CON<P2MODE1>
extern volatile __bit                   P2MODE1             __at(0x7589);	// @ (0xEB1 * 8 + 1)
#define                                 P2MODE1_bit         _BIT_ACCESS(PSMC2CON,1)
// PSMC2CON<P2MODE2>
extern volatile __bit                   P2MODE2             __at(0x758A);	// @ (0xEB1 * 8 + 2)
#define                                 P2MODE2_bit         _BIT_ACCESS(PSMC2CON,2)
// PSMC2CON<P2MODE3>
extern volatile __bit                   P2MODE3             __at(0x758B);	// @ (0xEB1 * 8 + 3)
#define                                 P2MODE3_bit         _BIT_ACCESS(PSMC2CON,3)
// PSMC2MDL<P2MSRC0>
extern volatile __bit                   P2MSRC0             __at(0x7590);	// @ (0xEB2 * 8 + 0)
#define                                 P2MSRC0_bit         _BIT_ACCESS(PSMC2MDL,0)
// PSMC2MDL<P2MSRC1>
extern volatile __bit                   P2MSRC1             __at(0x7591);	// @ (0xEB2 * 8 + 1)
#define                                 P2MSRC1_bit         _BIT_ACCESS(PSMC2MDL,1)
// PSMC2MDL<P2MSRC2>
extern volatile __bit                   P2MSRC2             __at(0x7592);	// @ (0xEB2 * 8 + 2)
#define                                 P2MSRC2_bit         _BIT_ACCESS(PSMC2MDL,2)
// PSMC2MDL<P2MSRC3>
extern volatile __bit                   P2MSRC3             __at(0x7593);	// @ (0xEB2 * 8 + 3)
#define                                 P2MSRC3_bit         _BIT_ACCESS(PSMC2MDL,3)
// PSMC2OEN<P2OEA>
extern volatile __bit                   P2OEA               __at(0x75A8);	// @ (0xEB5 * 8 + 0)
#define                                 P2OEA_bit           _BIT_ACCESS(PSMC2OEN,0)
// PSMC2OEN<P2OEB>
extern volatile __bit                   P2OEB               __at(0x75A9);	// @ (0xEB5 * 8 + 1)
#define                                 P2OEB_bit           _BIT_ACCESS(PSMC2OEN,1)
// PSMC2PHS<P2PHSC1>
extern volatile __bit                   P2PHSC1             __at(0x75D1);	// @ (0xEBA * 8 + 1)
#define                                 P2PHSC1_bit         _BIT_ACCESS(PSMC2PHS,1)
// PSMC2PHS<P2PHSC2>
extern volatile __bit                   P2PHSC2             __at(0x75D2);	// @ (0xEBA * 8 + 2)
#define                                 P2PHSC2_bit         _BIT_ACCESS(PSMC2PHS,2)
// PSMC2PHS<P2PHSC3>
extern volatile __bit                   P2PHSC3             __at(0x75D3);	// @ (0xEBA * 8 + 3)
#define                                 P2PHSC3_bit         _BIT_ACCESS(PSMC2PHS,3)
// PSMC2PHS<P2PHSC4>
extern volatile __bit                   P2PHSC4             __at(0x75D4);	// @ (0xEBA * 8 + 4)
#define                                 P2PHSC4_bit         _BIT_ACCESS(PSMC2PHS,4)
// PSMC2PHS<P2PHSIN>
extern volatile __bit                   P2PHSIN             __at(0x75D7);	// @ (0xEBA * 8 + 7)
#define                                 P2PHSIN_bit         _BIT_ACCESS(PSMC2PHS,7)
// PSMC2PHS<P2PHST>
extern volatile __bit                   P2PHST              __at(0x75D0);	// @ (0xEBA * 8 + 0)
#define                                 P2PHST_bit          _BIT_ACCESS(PSMC2PHS,0)
// PSMC2SYNC<P2POFST>
extern volatile __bit                   P2POFST             __at(0x759F);	// @ (0xEB3 * 8 + 7)
#define                                 P2POFST_bit         _BIT_ACCESS(PSMC2SYNC,7)
// PSMC2POL<P2POLA>
extern volatile __bit                   P2POLA              __at(0x75B0);	// @ (0xEB6 * 8 + 0)
#define                                 P2POLA_bit          _BIT_ACCESS(PSMC2POL,0)
// PSMC2POL<P2POLB>
extern volatile __bit                   P2POLB              __at(0x75B1);	// @ (0xEB6 * 8 + 1)
#define                                 P2POLB_bit          _BIT_ACCESS(PSMC2POL,1)
// PSMC2SYNC<P2PRPOL>
extern volatile __bit                   P2PRPOL             __at(0x759E);	// @ (0xEB3 * 8 + 6)
#define                                 P2PRPOL_bit         _BIT_ACCESS(PSMC2SYNC,6)
// PSMC2PRS<P2PRSC1>
extern volatile __bit                   P2PRSC1             __at(0x75E1);	// @ (0xEBC * 8 + 1)
#define                                 P2PRSC1_bit         _BIT_ACCESS(PSMC2PRS,1)
// PSMC2PRS<P2PRSC2>
extern volatile __bit                   P2PRSC2             __at(0x75E2);	// @ (0xEBC * 8 + 2)
#define                                 P2PRSC2_bit         _BIT_ACCESS(PSMC2PRS,2)
// PSMC2PRS<P2PRSC3>
extern volatile __bit                   P2PRSC3             __at(0x75E3);	// @ (0xEBC * 8 + 3)
#define                                 P2PRSC3_bit         _BIT_ACCESS(PSMC2PRS,3)
// PSMC2PRS<P2PRSC4>
extern volatile __bit                   P2PRSC4             __at(0x75E4);	// @ (0xEBC * 8 + 4)
#define                                 P2PRSC4_bit         _BIT_ACCESS(PSMC2PRS,4)
// PSMC2PRS<P2PRSIN>
extern volatile __bit                   P2PRSIN             __at(0x75E7);	// @ (0xEBC * 8 + 7)
#define                                 P2PRSIN_bit         _BIT_ACCESS(PSMC2PRS,7)
// PSMC2PRS<P2PRST>
extern volatile __bit                   P2PRST              __at(0x75E0);	// @ (0xEBC * 8 + 0)
#define                                 P2PRST_bit          _BIT_ACCESS(PSMC2PRS,0)
// PSMC2BLNK<P2REBM0>
extern volatile __bit                   P2REBM0             __at(0x75B8);	// @ (0xEB7 * 8 + 0)
#define                                 P2REBM0_bit         _BIT_ACCESS(PSMC2BLNK,0)
// PSMC2BLNK<P2REBM1>
extern volatile __bit                   P2REBM1             __at(0x75B9);	// @ (0xEB7 * 8 + 1)
#define                                 P2REBM1_bit         _BIT_ACCESS(PSMC2BLNK,1)
// PSMC2REBS<P2REBSC1>
extern volatile __bit                   P2REBSC1            __at(0x75C1);	// @ (0xEB8 * 8 + 1)
#define                                 P2REBSC1_bit        _BIT_ACCESS(PSMC2REBS,1)
// PSMC2REBS<P2REBSC2>
extern volatile __bit                   P2REBSC2            __at(0x75C2);	// @ (0xEB8 * 8 + 2)
#define                                 P2REBSC2_bit        _BIT_ACCESS(PSMC2REBS,2)
// PSMC2REBS<P2REBSC3>
extern volatile __bit                   P2REBSC3            __at(0x75C3);	// @ (0xEB8 * 8 + 3)
#define                                 P2REBSC3_bit        _BIT_ACCESS(PSMC2REBS,3)
// PSMC2REBS<P2REBSC4>
extern volatile __bit                   P2REBSC4            __at(0x75C4);	// @ (0xEB8 * 8 + 4)
#define                                 P2REBSC4_bit        _BIT_ACCESS(PSMC2REBS,4)
// PSMC2REBS<P2REBSIN>
extern volatile __bit                   P2REBSIN            __at(0x75C7);	// @ (0xEB8 * 8 + 7)
