MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1788/mcu.h
#define                                 P2REBSIN_bit        _BIT_ACCESS(PSMC2REBS,7)
// PSMC2STR1<P2SSYNC>
extern volatile __bit                   P2SSYNC             __at(0x767F);	// @ (0xECF * 8 + 7)
#define                                 P2SSYNC_bit         _BIT_ACCESS(PSMC2STR1,7)
// PSMC2STR0<P2STRA>
extern volatile __bit                   P2STRA              __at(0x7670);	// @ (0xECE * 8 + 0)
#define                                 P2STRA_bit          _BIT_ACCESS(PSMC2STR0,0)
// PSMC2STR0<P2STRB>
extern volatile __bit                   P2STRB              __at(0x7671);	// @ (0xECE * 8 + 1)
#define                                 P2STRB_bit          _BIT_ACCESS(PSMC2STR0,1)
// PSMC2SYNC<P2SYNC0>
extern volatile __bit                   P2SYNC0             __at(0x7598);	// @ (0xEB3 * 8 + 0)
#define                                 P2SYNC0_bit         _BIT_ACCESS(PSMC2SYNC,0)
// PSMC2SYNC<P2SYNC1>
extern volatile __bit                   P2SYNC1             __at(0x7599);	// @ (0xEB3 * 8 + 1)
#define                                 P2SYNC1_bit         _BIT_ACCESS(PSMC2SYNC,1)
// PSMC2SYNC<P2SYNC2>
extern volatile __bit                   P2SYNC2             __at(0x759A);	// @ (0xEB3 * 8 + 2)
#define                                 P2SYNC2_bit         _BIT_ACCESS(PSMC2SYNC,2)
// PSMC2INT<P2TDCIE>
extern volatile __bit                   P2TDCIE             __at(0x7605);	// @ (0xEC0 * 8 + 5)
#define                                 P2TDCIE_bit         _BIT_ACCESS(PSMC2INT,5)
// PSMC2INT<P2TDCIF>
extern volatile __bit                   P2TDCIF             __at(0x7601);	// @ (0xEC0 * 8 + 1)
#define                                 P2TDCIF_bit         _BIT_ACCESS(PSMC2INT,1)
// PSMC2INT<P2TOVIE>
extern volatile __bit                   P2TOVIE             __at(0x7607);	// @ (0xEC0 * 8 + 7)
#define                                 P2TOVIE_bit         _BIT_ACCESS(PSMC2INT,7)
// PSMC2INT<P2TOVIF>
extern volatile __bit                   P2TOVIF             __at(0x7603);	// @ (0xEC0 * 8 + 3)
#define                                 P2TOVIF_bit         _BIT_ACCESS(PSMC2INT,3)
// PSMC2INT<P2TPHIE>
extern volatile __bit                   P2TPHIE             __at(0x7606);	// @ (0xEC0 * 8 + 6)
#define                                 P2TPHIE_bit         _BIT_ACCESS(PSMC2INT,6)
// PSMC2INT<P2TPHIF>
extern volatile __bit                   P2TPHIF             __at(0x7602);	// @ (0xEC0 * 8 + 2)
#define                                 P2TPHIF_bit         _BIT_ACCESS(PSMC2INT,2)
// PSMC2INT<P2TPRIE>
extern volatile __bit                   P2TPRIE             __at(0x7604);	// @ (0xEC0 * 8 + 4)
#define                                 P2TPRIE_bit         _BIT_ACCESS(PSMC2INT,4)
// PSMC2INT<P2TPRIF>
extern volatile __bit                   P2TPRIF             __at(0x7600);	// @ (0xEC0 * 8 + 0)
#define                                 P2TPRIF_bit         _BIT_ACCESS(PSMC2INT,0)
// PSMC3ASDC<P3ARSEN>
extern volatile __bit                   P3ARSEN             __at(0x76ED);	// @ (0xEDD * 8 + 5)
#define                                 P3ARSEN_bit         _BIT_ACCESS(PSMC3ASDC,5)
// PSMC3ASDC<P3ASDEN>
extern volatile __bit                   P3ASDEN             __at(0x76EE);	// @ (0xEDD * 8 + 6)
#define                                 P3ASDEN_bit         _BIT_ACCESS(PSMC3ASDC,6)
// PSMC3ASDL<P3ASDLA>
extern volatile __bit                   P3ASDLA             __at(0x76F0);	// @ (0xEDE * 8 + 0)
#define                                 P3ASDLA_bit         _BIT_ACCESS(PSMC3ASDL,0)
// PSMC3ASDL<P3ASDLB>
extern volatile __bit                   P3ASDLB             __at(0x76F1);	// @ (0xEDE * 8 + 1)
#define                                 P3ASDLB_bit         _BIT_ACCESS(PSMC3ASDL,1)
// PSMC3ASDC<P3ASDOV>
extern volatile __bit                   P3ASDOV             __at(0x76E8);	// @ (0xEDD * 8 + 0)
#define                                 P3ASDOV_bit         _BIT_ACCESS(PSMC3ASDC,0)
// PSMC3ASDS<P3ASDSC1>
extern volatile __bit                   P3ASDSC1            __at(0x76F9);	// @ (0xEDF * 8 + 1)
#define                                 P3ASDSC1_bit        _BIT_ACCESS(PSMC3ASDS,1)
// PSMC3ASDS<P3ASDSC2>
extern volatile __bit                   P3ASDSC2            __at(0x76FA);	// @ (0xEDF * 8 + 2)
#define                                 P3ASDSC2_bit        _BIT_ACCESS(PSMC3ASDS,2)
// PSMC3ASDS<P3ASDSC3>
extern volatile __bit                   P3ASDSC3            __at(0x76FB);	// @ (0xEDF * 8 + 3)
#define                                 P3ASDSC3_bit        _BIT_ACCESS(PSMC3ASDS,3)
// PSMC3ASDS<P3ASDSC4>
extern volatile __bit                   P3ASDSC4            __at(0x76FC);	// @ (0xEDF * 8 + 4)
#define                                 P3ASDSC4_bit        _BIT_ACCESS(PSMC3ASDS,4)
// PSMC3ASDS<P3ASDSIN>
extern volatile __bit                   P3ASDSIN            __at(0x76FF);	// @ (0xEDF * 8 + 7)
#define                                 P3ASDSIN_bit        _BIT_ACCESS(PSMC3ASDS,7)
// PSMC3ASDC<P3ASE>
extern volatile __bit                   P3ASE               __at(0x76EF);	// @ (0xEDD * 8 + 7)
#define                                 P3ASE_bit           _BIT_ACCESS(PSMC3ASDC,7)
// PSMC3CLK<P3CPRE0>
extern volatile __bit                   P3CPRE0             __at(0x76A4);	// @ (0xED4 * 8 + 4)
#define                                 P3CPRE0_bit         _BIT_ACCESS(PSMC3CLK,4)
// PSMC3CLK<P3CPRE1>
extern volatile __bit                   P3CPRE1             __at(0x76A5);	// @ (0xED4 * 8 + 5)
#define                                 P3CPRE1_bit         _BIT_ACCESS(PSMC3CLK,5)
// PSMC3CLK<P3CSRC0>
extern volatile __bit                   P3CSRC0             __at(0x76A0);	// @ (0xED4 * 8 + 0)
#define                                 P3CSRC0_bit         _BIT_ACCESS(PSMC3CLK,0)
// PSMC3CLK<P3CSRC1>
extern volatile __bit                   P3CSRC1             __at(0x76A1);	// @ (0xED4 * 8 + 1)
#define                                 P3CSRC1_bit         _BIT_ACCESS(PSMC3CLK,1)
// PSMC3CON<P3DBFE>
extern volatile __bit                   P3DBFE              __at(0x768D);	// @ (0xED1 * 8 + 5)
#define                                 P3DBFE_bit          _BIT_ACCESS(PSMC3CON,5)
// PSMC3CON<P3DBRE>
extern volatile __bit                   P3DBRE              __at(0x768C);	// @ (0xED1 * 8 + 4)
#define                                 P3DBRE_bit          _BIT_ACCESS(PSMC3CON,4)
// PSMC3SYNC<P3DCPOL>
extern volatile __bit                   P3DCPOL             __at(0x769D);	// @ (0xED3 * 8 + 5)
#define                                 P3DCPOL_bit         _BIT_ACCESS(PSMC3SYNC,5)
// PSMC3DCS<P3DCSC1>
extern volatile __bit                   P3DCSC1             __at(0x76D9);	// @ (0xEDB * 8 + 1)
#define                                 P3DCSC1_bit         _BIT_ACCESS(PSMC3DCS,1)
// PSMC3DCS<P3DCSC2>
extern volatile __bit                   P3DCSC2             __at(0x76DA);	// @ (0xEDB * 8 + 2)
#define                                 P3DCSC2_bit         _BIT_ACCESS(PSMC3DCS,2)
// PSMC3DCS<P3DCSC3>
extern volatile __bit                   P3DCSC3             __at(0x76DB);	// @ (0xEDB * 8 + 3)
#define                                 P3DCSC3_bit         _BIT_ACCESS(PSMC3DCS,3)
// PSMC3DCS<P3DCSC4>
extern volatile __bit                   P3DCSC4             __at(0x76DC);	// @ (0xEDB * 8 + 4)
#define                                 P3DCSC4_bit         _BIT_ACCESS(PSMC3DCS,4)
// PSMC3DCS<P3DCSIN>
extern volatile __bit                   P3DCSIN             __at(0x76DF);	// @ (0xEDB * 8 + 7)
#define                                 P3DCSIN_bit         _BIT_ACCESS(PSMC3DCS,7)
// PSMC3DCS<P3DCST>
extern volatile __bit                   P3DCST              __at(0x76D8);	// @ (0xEDB * 8 + 0)
#define                                 P3DCST_bit          _BIT_ACCESS(PSMC3DCS,0)
// PSMC3BLNK<P3FEBM0>
extern volatile __bit                   P3FEBM0             __at(0x76BC);	// @ (0xED7 * 8 + 4)
#define                                 P3FEBM0_bit         _BIT_ACCESS(PSMC3BLNK,4)
// PSMC3BLNK<P3FEBM1>
extern volatile __bit                   P3FEBM1             __at(0x76BD);	// @ (0xED7 * 8 + 5)
#define                                 P3FEBM1_bit         _BIT_ACCESS(PSMC3BLNK,5)
// PSMC3FEBS<P3FEBSC1>
extern volatile __bit                   P3FEBSC1            __at(0x76C9);	// @ (0xED9 * 8 + 1)
#define                                 P3FEBSC1_bit        _BIT_ACCESS(PSMC3FEBS,1)
// PSMC3FEBS<P3FEBSC2>
extern volatile __bit                   P3FEBSC2            __at(0x76CA);	// @ (0xED9 * 8 + 2)
#define                                 P3FEBSC2_bit        _BIT_ACCESS(PSMC3FEBS,2)
// PSMC3FEBS<P3FEBSC3>
extern volatile __bit                   P3FEBSC3            __at(0x76CB);	// @ (0xED9 * 8 + 3)
#define                                 P3FEBSC3_bit        _BIT_ACCESS(PSMC3FEBS,3)
// PSMC3FEBS<P3FEBSC4>
extern volatile __bit                   P3FEBSC4            __at(0x76CC);	// @ (0xED9 * 8 + 4)
#define                                 P3FEBSC4_bit        _BIT_ACCESS(PSMC3FEBS,4)
// PSMC3FEBS<P3FEBSIN>
extern volatile __bit                   P3FEBSIN            __at(0x76CF);	// @ (0xED9 * 8 + 7)
#define                                 P3FEBSIN_bit        _BIT_ACCESS(PSMC3FEBS,7)
// PSMC3STR1<P3HSMEN>
extern volatile __bit                   P3HSMEN             __at(0x7778);	// @ (0xEEF * 8 + 0)
#define                                 P3HSMEN_bit         _BIT_ACCESS(PSMC3STR1,0)
// PSMC3POL<P3INPOL>
extern volatile __bit                   P3INPOL             __at(0x76B6);	// @ (0xED6 * 8 + 6)
#define                                 P3INPOL_bit         _BIT_ACCESS(PSMC3POL,6)
// PSMC3STR1<P3LSMEN>
extern volatile __bit                   P3LSMEN             __at(0x7779);	// @ (0xEEF * 8 + 1)
#define                                 P3LSMEN_bit         _BIT_ACCESS(PSMC3STR1,1)
// PSMC3MDL<P3MDLBIT>
extern volatile __bit                   P3MDLBIT            __at(0x7695);	// @ (0xED2 * 8 + 5)
#define                                 P3MDLBIT_bit        _BIT_ACCESS(PSMC3MDL,5)
// PSMC3MDL<P3MDLEN>
extern volatile __bit                   P3MDLEN             __at(0x7697);	// @ (0xED2 * 8 + 7)
#define                                 P3MDLEN_bit         _BIT_ACCESS(PSMC3MDL,7)
// PSMC3MDL<P3MDLPOL>
extern volatile __bit                   P3MDLPOL            __at(0x7696);	// @ (0xED2 * 8 + 6)
#define                                 P3MDLPOL_bit        _BIT_ACCESS(PSMC3MDL,6)
// PSMC3CON<P3MODE0>
extern volatile __bit                   P3MODE0             __at(0x7688);	// @ (0xED1 * 8 + 0)
#define                                 P3MODE0_bit         _BIT_ACCESS(PSMC3CON,0)
// PSMC3CON<P3MODE1>
extern volatile __bit                   P3MODE1             __at(0x7689);	// @ (0xED1 * 8 + 1)
#define                                 P3MODE1_bit         _BIT_ACCESS(PSMC3CON,1)
// PSMC3CON<P3MODE2>
extern volatile __bit                   P3MODE2             __at(0x768A);	// @ (0xED1 * 8 + 2)
#define                                 P3MODE2_bit         _BIT_ACCESS(PSMC3CON,2)
// PSMC3CON<P3MODE3>
extern volatile __bit                   P3MODE3             __at(0x768B);	// @ (0xED1 * 8 + 3)
#define                                 P3MODE3_bit         _BIT_ACCESS(PSMC3CON,3)
// PSMC3MDL<P3MSRC0>
extern volatile __bit                   P3MSRC0             __at(0x7690);	// @ (0xED2 * 8 + 0)
#define                                 P3MSRC0_bit         _BIT_ACCESS(PSMC3MDL,0)
// PSMC3MDL<P3MSRC1>
extern volatile __bit                   P3MSRC1             __at(0x7691);	// @ (0xED2 * 8 + 1)
#define                                 P3MSRC1_bit         _BIT_ACCESS(PSMC3MDL,1)
// PSMC3MDL<P3MSRC2>
extern volatile __bit                   P3MSRC2             __at(0x7692);	// @ (0xED2 * 8 + 2)
#define                                 P3MSRC2_bit         _BIT_ACCESS(PSMC3MDL,2)
// PSMC3MDL<P3MSRC3>
extern volatile __bit                   P3MSRC3             __at(0x7693);	// @ (0xED2 * 8 + 3)
#define                                 P3MSRC3_bit         _BIT_ACCESS(PSMC3MDL,3)
// PSMC3OEN<P3OEA>
extern volatile __bit                   P3OEA               __at(0x76A8);	// @ (0xED5 * 8 + 0)
#define                                 P3OEA_bit           _BIT_ACCESS(PSMC3OEN,0)
// PSMC3OEN<P3OEB>
extern volatile __bit                   P3OEB               __at(0x76A9);	// @ (0xED5 * 8 + 1)
#define                                 P3OEB_bit           _BIT_ACCESS(PSMC3OEN,1)
// PSMC3PHS<P3PHSC1>
extern volatile __bit                   P3PHSC1             __at(0x76D1);	// @ (0xEDA * 8 + 1)
#define                                 P3PHSC1_bit         _BIT_ACCESS(PSMC3PHS,1)
// PSMC3PHS<P3PHSC2>
extern volatile __bit                   P3PHSC2             __at(0x76D2);	// @ (0xEDA * 8 + 2)
#define                                 P3PHSC2_bit         _BIT_ACCESS(PSMC3PHS,2)
// PSMC3PHS<P3PHSC3>
extern volatile __bit                   P3PHSC3             __at(0x76D3);	// @ (0xEDA * 8 + 3)
#define                                 P3PHSC3_bit         _BIT_ACCESS(PSMC3PHS,3)
// PSMC3PHS<P3PHSC4>
extern volatile __bit                   P3PHSC4             __at(0x76D4);	// @ (0xEDA * 8 + 4)
#define                                 P3PHSC4_bit         _BIT_ACCESS(PSMC3PHS,4)
// PSMC3PHS<P3PHSIN>
extern volatile __bit                   P3PHSIN             __at(0x76D7);	// @ (0xEDA * 8 + 7)
#define                                 P3PHSIN_bit         _BIT_ACCESS(PSMC3PHS,7)
// PSMC3PHS<P3PHST>
extern volatile __bit                   P3PHST              __at(0x76D0);	// @ (0xEDA * 8 + 0)
#define                                 P3PHST_bit          _BIT_ACCESS(PSMC3PHS,0)
// PSMC3SYNC<P3POFST>
extern volatile __bit                   P3POFST             __at(0x769F);	// @ (0xED3 * 8 + 7)
#define                                 P3POFST_bit         _BIT_ACCESS(PSMC3SYNC,7)
// PSMC3POL<P3POLA>
extern volatile __bit                   P3POLA              __at(0x76B0);	// @ (0xED6 * 8 + 0)
#define                                 P3POLA_bit          _BIT_ACCESS(PSMC3POL,0)
// PSMC3POL<P3POLB>
extern volatile __bit                   P3POLB              __at(0x76B1);	// @ (0xED6 * 8 + 1)
#define                                 P3POLB_bit          _BIT_ACCESS(PSMC3POL,1)
// PSMC3SYNC<P3PRPOL>
extern volatile __bit                   P3PRPOL             __at(0x769E);	// @ (0xED3 * 8 + 6)
#define                                 P3PRPOL_bit         _BIT_ACCESS(PSMC3SYNC,6)
// PSMC3PRS<P3PRSC1>
extern volatile __bit                   P3PRSC1             __at(0x76E1);	// @ (0xEDC * 8 + 1)
#define                                 P3PRSC1_bit         _BIT_ACCESS(PSMC3PRS,1)
// PSMC3PRS<P3PRSC2>
extern volatile __bit                   P3PRSC2             __at(0x76E2);	// @ (0xEDC * 8 + 2)
#define                                 P3PRSC2_bit         _BIT_ACCESS(PSMC3PRS,2)
// PSMC3PRS<P3PRSC3>
extern volatile __bit                   P3PRSC3             __at(0x76E3);	// @ (0xEDC * 8 + 3)
#define                                 P3PRSC3_bit         _BIT_ACCESS(PSMC3PRS,3)
// PSMC3PRS<P3PRSC4>
extern volatile __bit                   P3PRSC4             __at(0x76E4);	// @ (0xEDC * 8 + 4)
#define                                 P3PRSC4_bit         _BIT_ACCESS(PSMC3PRS,4)
// PSMC3PRS<P3PRSIN>
extern volatile __bit                   P3PRSIN             __at(0x76E7);	// @ (0xEDC * 8 + 7)
#define                                 P3PRSIN_bit         _BIT_ACCESS(PSMC3PRS,7)
// PSMC3PRS<P3PRST>
extern volatile __bit                   P3PRST              __at(0x76E0);	// @ (0xEDC * 8 + 0)
#define                                 P3PRST_bit          _BIT_ACCESS(PSMC3PRS,0)
// PSMC3BLNK<P3REBM0>
extern volatile __bit                   P3REBM0             __at(0x76B8);	// @ (0xED7 * 8 + 0)
#define                                 P3REBM0_bit         _BIT_ACCESS(PSMC3BLNK,0)
// PSMC3BLNK<P3REBM1>
extern volatile __bit                   P3REBM1             __at(0x76B9);	// @ (0xED7 * 8 + 1)
#define                                 P3REBM1_bit         _BIT_ACCESS(PSMC3BLNK,1)
// PSMC3REBS<P3REBSC1>
extern volatile __bit                   P3REBSC1            __at(0x76C1);	// @ (0xED8 * 8 + 1)
#define                                 P3REBSC1_bit        _BIT_ACCESS(PSMC3REBS,1)
// PSMC3REBS<P3REBSC2>
extern volatile __bit                   P3REBSC2            __at(0x76C2);	// @ (0xED8 * 8 + 2)
#define                                 P3REBSC2_bit        _BIT_ACCESS(PSMC3REBS,2)
// PSMC3REBS<P3REBSC3>
extern volatile __bit                   P3REBSC3            __at(0x76C3);	// @ (0xED8 * 8 + 3)
#define                                 P3REBSC3_bit        _BIT_ACCESS(PSMC3REBS,3)
// PSMC3REBS<P3REBSC4>
extern volatile __bit                   P3REBSC4            __at(0x76C4);	// @ (0xED8 * 8 + 4)
#define                                 P3REBSC4_bit        _BIT_ACCESS(PSMC3REBS,4)
// PSMC3REBS<P3REBSIN>
extern volatile __bit                   P3REBSIN            __at(0x76C7);	// @ (0xED8 * 8 + 7)
#define                                 P3REBSIN_bit        _BIT_ACCESS(PSMC3REBS,7)
// PSMC3STR1<P3SSYNC>
extern volatile __bit                   P3SSYNC             __at(0x777F);	// @ (0xEEF * 8 + 7)
#define                                 P3SSYNC_bit         _BIT_ACCESS(PSMC3STR1,7)
// PSMC3STR0<P3STRA>
extern volatile __bit                   P3STRA              __at(0x7770);	// @ (0xEEE * 8 + 0)
#define                                 P3STRA_bit          _BIT_ACCESS(PSMC3STR0,0)
// PSMC3STR0<P3STRB>
extern volatile __bit                   P3STRB              __at(0x7771);	// @ (0xEEE * 8 + 1)
#define                                 P3STRB_bit          _BIT_ACCESS(PSMC3STR0,1)
// PSMC3SYNC<P3SYNC0>
extern volatile __bit                   P3SYNC0             __at(0x7698);	// @ (0xED3 * 8 + 0)
#define                                 P3SYNC0_bit         _BIT_ACCESS(PSMC3SYNC,0)
// PSMC3SYNC<P3SYNC1>
extern volatile __bit                   P3SYNC1             __at(0x7699);	// @ (0xED3 * 8 + 1)
#define                                 P3SYNC1_bit         _BIT_ACCESS(PSMC3SYNC,1)
// PSMC3SYNC<P3SYNC2>
extern volatile __bit                   P3SYNC2             __at(0x769A);	// @ (0xED3 * 8 + 2)
#define                                 P3SYNC2_bit         _BIT_ACCESS(PSMC3SYNC,2)
// PSMC3INT<P3TDCIE>
extern volatile __bit                   P3TDCIE             __at(0x7705);	// @ (0xEE0 * 8 + 5)
#define                                 P3TDCIE_bit         _BIT_ACCESS(PSMC3INT,5)
// PSMC3INT<P3TDCIF>
extern volatile __bit                   P3TDCIF             __at(0x7701);	// @ (0xEE0 * 8 + 1)
#define                                 P3TDCIF_bit         _BIT_ACCESS(PSMC3INT,1)
// PSMC3INT<P3TOVIE>
extern volatile __bit                   P3TOVIE             __at(0x7707);	// @ (0xEE0 * 8 + 7)
#define                                 P3TOVIE_bit         _BIT_ACCESS(PSMC3INT,7)
// PSMC3INT<P3TOVIF>
extern volatile __bit                   P3TOVIF             __at(0x7703);	// @ (0xEE0 * 8 + 3)
#define                                 P3TOVIF_bit         _BIT_ACCESS(PSMC3INT,3)
// PSMC3INT<P3TPHIE>
extern volatile __bit                   P3TPHIE             __at(0x7706);	// @ (0xEE0 * 8 + 6)
#define                                 P3TPHIE_bit         _BIT_ACCESS(PSMC3INT,6)
// PSMC3INT<P3TPHIF>
extern volatile __bit                   P3TPHIF             __at(0x7702);	// @ (0xEE0 * 8 + 2)
#define                                 P3TPHIF_bit         _BIT_ACCESS(PSMC3INT,2)
// PSMC3INT<P3TPRIE>
extern volatile __bit                   P3TPRIE             __at(0x7704);	// @ (0xEE0 * 8 + 4)
#define                                 P3TPRIE_bit         _BIT_ACCESS(PSMC3INT,4)
// PSMC3INT<P3TPRIF>
extern volatile __bit                   P3TPRIF             __at(0x7700);	// @ (0xEE0 * 8 + 0)
#define                                 P3TPRIF_bit         _BIT_ACCESS(PSMC3INT,0)
// PSMC4ASDC<P4ARSEN>
extern volatile __bit                   P4ARSEN             __at(0x78ED);	// @ (0xF1D * 8 + 5)
#define                                 P4ARSEN_bit         _BIT_ACCESS(PSMC4ASDC,5)
// PSMC4ASDC<P4ASDEN>
extern volatile __bit                   P4ASDEN             __at(0x78EE);	// @ (0xF1D * 8 + 6)
#define                                 P4ASDEN_bit         _BIT_ACCESS(PSMC4ASDC,6)
// PSMC4ASDL<P4ASDLA>
extern volatile __bit                   P4ASDLA             __at(0x78F0);	// @ (0xF1E * 8 + 0)
#define                                 P4ASDLA_bit         _BIT_ACCESS(PSMC4ASDL,0)
// PSMC4ASDL<P4ASDLB>
extern volatile __bit                   P4ASDLB             __at(0x78F1);	// @ (0xF1E * 8 + 1)
#define                                 P4ASDLB_bit         _BIT_ACCESS(PSMC4ASDL,1)
// PSMC4ASDC<P4ASDOV>
extern volatile __bit                   P4ASDOV             __at(0x78E8);	// @ (0xF1D * 8 + 0)
#define                                 P4ASDOV_bit         _BIT_ACCESS(PSMC4ASDC,0)
// PSMC4ASDS<P4ASDSC1>
extern volatile __bit                   P4ASDSC1            __at(0x78F9);	// @ (0xF1F * 8 + 1)
#define                                 P4ASDSC1_bit        _BIT_ACCESS(PSMC4ASDS,1)
// PSMC4ASDS<P4ASDSC2>
extern volatile __bit                   P4ASDSC2            __at(0x78FA);	// @ (0xF1F * 8 + 2)
#define                                 P4ASDSC2_bit        _BIT_ACCESS(PSMC4ASDS,2)
// PSMC4ASDS<P4ASDSC3>
extern volatile __bit                   P4ASDSC3            __at(0x78FB);	// @ (0xF1F * 8 + 3)
#define                                 P4ASDSC3_bit        _BIT_ACCESS(PSMC4ASDS,3)
// PSMC4ASDS<P4ASDSC4>
extern volatile __bit                   P4ASDSC4            __at(0x78FC);	// @ (0xF1F * 8 + 4)
#define                                 P4ASDSC4_bit        _BIT_ACCESS(PSMC4ASDS,4)
// PSMC4ASDS<P4ASDSIN>
extern volatile __bit                   P4ASDSIN            __at(0x78FF);	// @ (0xF1F * 8 + 7)
#define                                 P4ASDSIN_bit        _BIT_ACCESS(PSMC4ASDS,7)
// PSMC4ASDC<P4ASE>
extern volatile __bit                   P4ASE               __at(0x78EF);	// @ (0xF1D * 8 + 7)
#define                                 P4ASE_bit           _BIT_ACCESS(PSMC4ASDC,7)
// PSMC4CLK<P4CPRE0>
extern volatile __bit                   P4CPRE0             __at(0x78A4);	// @ (0xF14 * 8 + 4)
#define                                 P4CPRE0_bit         _BIT_ACCESS(PSMC4CLK,4)
// PSMC4CLK<P4CPRE1>
extern volatile __bit                   P4CPRE1             __at(0x78A5);	// @ (0xF14 * 8 + 5)
#define                                 P4CPRE1_bit         _BIT_ACCESS(PSMC4CLK,5)
// PSMC4CLK<P4CSRC0>
extern volatile __bit                   P4CSRC0             __at(0x78A0);	// @ (0xF14 * 8 + 0)
#define                                 P4CSRC0_bit         _BIT_ACCESS(PSMC4CLK,0)
// PSMC4CLK<P4CSRC1>
extern volatile __bit                   P4CSRC1             __at(0x78A1);	// @ (0xF14 * 8 + 1)
#define                                 P4CSRC1_bit         _BIT_ACCESS(PSMC4CLK,1)
// PSMC4CON<P4DBFE>
extern volatile __bit                   P4DBFE              __at(0x788D);	// @ (0xF11 * 8 + 5)
#define                                 P4DBFE_bit          _BIT_ACCESS(PSMC4CON,5)
// PSMC4CON<P4DBRE>
extern volatile __bit                   P4DBRE              __at(0x788C);	// @ (0xF11 * 8 + 4)
#define                                 P4DBRE_bit          _BIT_ACCESS(PSMC4CON,4)
// PSMC4SYNC<P4DCPOL>
extern volatile __bit                   P4DCPOL             __at(0x789D);	// @ (0xF13 * 8 + 5)
#define                                 P4DCPOL_bit         _BIT_ACCESS(PSMC4SYNC,5)
// PSMC4DCS<P4DCSC1>
extern volatile __bit                   P4DCSC1             __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 P4DCSC1_bit         _BIT_ACCESS(PSMC4DCS,1)
// PSMC4DCS<P4DCSC2>
extern volatile __bit                   P4DCSC2             __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 P4DCSC2_bit         _BIT_ACCESS(PSMC4DCS,2)
// PSMC4DCS<P4DCSC3>
extern volatile __bit                   P4DCSC3             __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 P4DCSC3_bit         _BIT_ACCESS(PSMC4DCS,3)
