MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1788/mcu.h
// PSMC4DCS<P4DCSC4>
extern volatile __bit                   P4DCSC4             __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 P4DCSC4_bit         _BIT_ACCESS(PSMC4DCS,4)
// PSMC4DCS<P4DCSIN>
extern volatile __bit                   P4DCSIN             __at(0x78DF);	// @ (0xF1B * 8 + 7)
#define                                 P4DCSIN_bit         _BIT_ACCESS(PSMC4DCS,7)
// PSMC4DCS<P4DCST>
extern volatile __bit                   P4DCST              __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 P4DCST_bit          _BIT_ACCESS(PSMC4DCS,0)
// PSMC4BLNK<P4FEBM0>
extern volatile __bit                   P4FEBM0             __at(0x78BC);	// @ (0xF17 * 8 + 4)
#define                                 P4FEBM0_bit         _BIT_ACCESS(PSMC4BLNK,4)
// PSMC4BLNK<P4FEBM1>
extern volatile __bit                   P4FEBM1             __at(0x78BD);	// @ (0xF17 * 8 + 5)
#define                                 P4FEBM1_bit         _BIT_ACCESS(PSMC4BLNK,5)
// PSMC4FEBS<P4FEBSC1>
extern volatile __bit                   P4FEBSC1            __at(0x78C9);	// @ (0xF19 * 8 + 1)
#define                                 P4FEBSC1_bit        _BIT_ACCESS(PSMC4FEBS,1)
// PSMC4FEBS<P4FEBSC2>
extern volatile __bit                   P4FEBSC2            __at(0x78CA);	// @ (0xF19 * 8 + 2)
#define                                 P4FEBSC2_bit        _BIT_ACCESS(PSMC4FEBS,2)
// PSMC4FEBS<P4FEBSC3>
extern volatile __bit                   P4FEBSC3            __at(0x78CB);	// @ (0xF19 * 8 + 3)
#define                                 P4FEBSC3_bit        _BIT_ACCESS(PSMC4FEBS,3)
// PSMC4FEBS<P4FEBSC4>
extern volatile __bit                   P4FEBSC4            __at(0x78CC);	// @ (0xF19 * 8 + 4)
#define                                 P4FEBSC4_bit        _BIT_ACCESS(PSMC4FEBS,4)
// PSMC4FEBS<P4FEBSIN>
extern volatile __bit                   P4FEBSIN            __at(0x78CF);	// @ (0xF19 * 8 + 7)
#define                                 P4FEBSIN_bit        _BIT_ACCESS(PSMC4FEBS,7)
// PSMC4STR1<P4HSMEN>
extern volatile __bit                   P4HSMEN             __at(0x7978);	// @ (0xF2F * 8 + 0)
#define                                 P4HSMEN_bit         _BIT_ACCESS(PSMC4STR1,0)
// PSMC4POL<P4INPOL>
extern volatile __bit                   P4INPOL             __at(0x78B6);	// @ (0xF16 * 8 + 6)
#define                                 P4INPOL_bit         _BIT_ACCESS(PSMC4POL,6)
// PSMC4STR1<P4LSMEN>
extern volatile __bit                   P4LSMEN             __at(0x7979);	// @ (0xF2F * 8 + 1)
#define                                 P4LSMEN_bit         _BIT_ACCESS(PSMC4STR1,1)
// PSMC4MDL<P4MDLBIT>
extern volatile __bit                   P4MDLBIT            __at(0x7895);	// @ (0xF12 * 8 + 5)
#define                                 P4MDLBIT_bit        _BIT_ACCESS(PSMC4MDL,5)
// PSMC4MDL<P4MDLEN>
extern volatile __bit                   P4MDLEN             __at(0x7897);	// @ (0xF12 * 8 + 7)
#define                                 P4MDLEN_bit         _BIT_ACCESS(PSMC4MDL,7)
// PSMC4MDL<P4MDLPOL>
extern volatile __bit                   P4MDLPOL            __at(0x7896);	// @ (0xF12 * 8 + 6)
#define                                 P4MDLPOL_bit        _BIT_ACCESS(PSMC4MDL,6)
// PSMC4CON<P4MODE0>
extern volatile __bit                   P4MODE0             __at(0x7888);	// @ (0xF11 * 8 + 0)
#define                                 P4MODE0_bit         _BIT_ACCESS(PSMC4CON,0)
// PSMC4CON<P4MODE1>
extern volatile __bit                   P4MODE1             __at(0x7889);	// @ (0xF11 * 8 + 1)
#define                                 P4MODE1_bit         _BIT_ACCESS(PSMC4CON,1)
// PSMC4CON<P4MODE2>
extern volatile __bit                   P4MODE2             __at(0x788A);	// @ (0xF11 * 8 + 2)
#define                                 P4MODE2_bit         _BIT_ACCESS(PSMC4CON,2)
// PSMC4CON<P4MODE3>
extern volatile __bit                   P4MODE3             __at(0x788B);	// @ (0xF11 * 8 + 3)
#define                                 P4MODE3_bit         _BIT_ACCESS(PSMC4CON,3)
// PSMC4MDL<P4MSRC0>
extern volatile __bit                   P4MSRC0             __at(0x7890);	// @ (0xF12 * 8 + 0)
#define                                 P4MSRC0_bit         _BIT_ACCESS(PSMC4MDL,0)
// PSMC4MDL<P4MSRC1>
extern volatile __bit                   P4MSRC1             __at(0x7891);	// @ (0xF12 * 8 + 1)
#define                                 P4MSRC1_bit         _BIT_ACCESS(PSMC4MDL,1)
// PSMC4MDL<P4MSRC2>
extern volatile __bit                   P4MSRC2             __at(0x7892);	// @ (0xF12 * 8 + 2)
#define                                 P4MSRC2_bit         _BIT_ACCESS(PSMC4MDL,2)
// PSMC4MDL<P4MSRC3>
extern volatile __bit                   P4MSRC3             __at(0x7893);	// @ (0xF12 * 8 + 3)
#define                                 P4MSRC3_bit         _BIT_ACCESS(PSMC4MDL,3)
// PSMC4OEN<P4OEA>
extern volatile __bit                   P4OEA               __at(0x78A8);	// @ (0xF15 * 8 + 0)
#define                                 P4OEA_bit           _BIT_ACCESS(PSMC4OEN,0)
// PSMC4OEN<P4OEB>
extern volatile __bit                   P4OEB               __at(0x78A9);	// @ (0xF15 * 8 + 1)
#define                                 P4OEB_bit           _BIT_ACCESS(PSMC4OEN,1)
// PSMC4PHS<P4PHSC1>
extern volatile __bit                   P4PHSC1             __at(0x78D1);	// @ (0xF1A * 8 + 1)
#define                                 P4PHSC1_bit         _BIT_ACCESS(PSMC4PHS,1)
// PSMC4PHS<P4PHSC2>
extern volatile __bit                   P4PHSC2             __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 P4PHSC2_bit         _BIT_ACCESS(PSMC4PHS,2)
// PSMC4PHS<P4PHSC3>
extern volatile __bit                   P4PHSC3             __at(0x78D3);	// @ (0xF1A * 8 + 3)
#define                                 P4PHSC3_bit         _BIT_ACCESS(PSMC4PHS,3)
// PSMC4PHS<P4PHSC4>
extern volatile __bit                   P4PHSC4             __at(0x78D4);	// @ (0xF1A * 8 + 4)
#define                                 P4PHSC4_bit         _BIT_ACCESS(PSMC4PHS,4)
// PSMC4PHS<P4PHSIN>
extern volatile __bit                   P4PHSIN             __at(0x78D7);	// @ (0xF1A * 8 + 7)
#define                                 P4PHSIN_bit         _BIT_ACCESS(PSMC4PHS,7)
// PSMC4PHS<P4PHST>
extern volatile __bit                   P4PHST              __at(0x78D0);	// @ (0xF1A * 8 + 0)
#define                                 P4PHST_bit          _BIT_ACCESS(PSMC4PHS,0)
// PSMC4SYNC<P4POFST>
extern volatile __bit                   P4POFST             __at(0x789F);	// @ (0xF13 * 8 + 7)
#define                                 P4POFST_bit         _BIT_ACCESS(PSMC4SYNC,7)
// PSMC4POL<P4POLA>
extern volatile __bit                   P4POLA              __at(0x78B0);	// @ (0xF16 * 8 + 0)
#define                                 P4POLA_bit          _BIT_ACCESS(PSMC4POL,0)
// PSMC4POL<P4POLB>
extern volatile __bit                   P4POLB              __at(0x78B1);	// @ (0xF16 * 8 + 1)
#define                                 P4POLB_bit          _BIT_ACCESS(PSMC4POL,1)
// PSMC4SYNC<P4PRPOL>
extern volatile __bit                   P4PRPOL             __at(0x789E);	// @ (0xF13 * 8 + 6)
#define                                 P4PRPOL_bit         _BIT_ACCESS(PSMC4SYNC,6)
// PSMC4PRS<P4PRSC1>
extern volatile __bit                   P4PRSC1             __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 P4PRSC1_bit         _BIT_ACCESS(PSMC4PRS,1)
// PSMC4PRS<P4PRSC2>
extern volatile __bit                   P4PRSC2             __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 P4PRSC2_bit         _BIT_ACCESS(PSMC4PRS,2)
// PSMC4PRS<P4PRSC3>
extern volatile __bit                   P4PRSC3             __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 P4PRSC3_bit         _BIT_ACCESS(PSMC4PRS,3)
// PSMC4PRS<P4PRSC4>
extern volatile __bit                   P4PRSC4             __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 P4PRSC4_bit         _BIT_ACCESS(PSMC4PRS,4)
// PSMC4PRS<P4PRSIN>
extern volatile __bit                   P4PRSIN             __at(0x78E7);	// @ (0xF1C * 8 + 7)
#define                                 P4PRSIN_bit         _BIT_ACCESS(PSMC4PRS,7)
// PSMC4PRS<P4PRST>
extern volatile __bit                   P4PRST              __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 P4PRST_bit          _BIT_ACCESS(PSMC4PRS,0)
// PSMC4BLNK<P4REBM0>
extern volatile __bit                   P4REBM0             __at(0x78B8);	// @ (0xF17 * 8 + 0)
#define                                 P4REBM0_bit         _BIT_ACCESS(PSMC4BLNK,0)
// PSMC4BLNK<P4REBM1>
extern volatile __bit                   P4REBM1             __at(0x78B9);	// @ (0xF17 * 8 + 1)
#define                                 P4REBM1_bit         _BIT_ACCESS(PSMC4BLNK,1)
// PSMC4REBS<P4REBSC1>
extern volatile __bit                   P4REBSC1            __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 P4REBSC1_bit        _BIT_ACCESS(PSMC4REBS,1)
// PSMC4REBS<P4REBSC2>
extern volatile __bit                   P4REBSC2            __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 P4REBSC2_bit        _BIT_ACCESS(PSMC4REBS,2)
// PSMC4REBS<P4REBSC3>
extern volatile __bit                   P4REBSC3            __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 P4REBSC3_bit        _BIT_ACCESS(PSMC4REBS,3)
// PSMC4REBS<P4REBSC4>
extern volatile __bit                   P4REBSC4            __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 P4REBSC4_bit        _BIT_ACCESS(PSMC4REBS,4)
// PSMC4REBS<P4REBSIN>
extern volatile __bit                   P4REBSIN            __at(0x78C7);	// @ (0xF18 * 8 + 7)
#define                                 P4REBSIN_bit        _BIT_ACCESS(PSMC4REBS,7)
// PSMC4STR1<P4SSYNC>
extern volatile __bit                   P4SSYNC             __at(0x797F);	// @ (0xF2F * 8 + 7)
#define                                 P4SSYNC_bit         _BIT_ACCESS(PSMC4STR1,7)
// PSMC4STR0<P4STRA>
extern volatile __bit                   P4STRA              __at(0x7970);	// @ (0xF2E * 8 + 0)
#define                                 P4STRA_bit          _BIT_ACCESS(PSMC4STR0,0)
// PSMC4STR0<P4STRB>
extern volatile __bit                   P4STRB              __at(0x7971);	// @ (0xF2E * 8 + 1)
#define                                 P4STRB_bit          _BIT_ACCESS(PSMC4STR0,1)
// PSMC4SYNC<P4SYNC0>
extern volatile __bit                   P4SYNC0             __at(0x7898);	// @ (0xF13 * 8 + 0)
#define                                 P4SYNC0_bit         _BIT_ACCESS(PSMC4SYNC,0)
// PSMC4SYNC<P4SYNC1>
extern volatile __bit                   P4SYNC1             __at(0x7899);	// @ (0xF13 * 8 + 1)
#define                                 P4SYNC1_bit         _BIT_ACCESS(PSMC4SYNC,1)
// PSMC4SYNC<P4SYNC2>
extern volatile __bit                   P4SYNC2             __at(0x789A);	// @ (0xF13 * 8 + 2)
#define                                 P4SYNC2_bit         _BIT_ACCESS(PSMC4SYNC,2)
// PSMC4INT<P4TDCIE>
extern volatile __bit                   P4TDCIE             __at(0x7905);	// @ (0xF20 * 8 + 5)
#define                                 P4TDCIE_bit         _BIT_ACCESS(PSMC4INT,5)
// PSMC4INT<P4TDCIF>
extern volatile __bit                   P4TDCIF             __at(0x7901);	// @ (0xF20 * 8 + 1)
#define                                 P4TDCIF_bit         _BIT_ACCESS(PSMC4INT,1)
// PSMC4INT<P4TOVIE>
extern volatile __bit                   P4TOVIE             __at(0x7907);	// @ (0xF20 * 8 + 7)
#define                                 P4TOVIE_bit         _BIT_ACCESS(PSMC4INT,7)
// PSMC4INT<P4TOVIF>
extern volatile __bit                   P4TOVIF             __at(0x7903);	// @ (0xF20 * 8 + 3)
#define                                 P4TOVIF_bit         _BIT_ACCESS(PSMC4INT,3)
// PSMC4INT<P4TPHIE>
extern volatile __bit                   P4TPHIE             __at(0x7906);	// @ (0xF20 * 8 + 6)
#define                                 P4TPHIE_bit         _BIT_ACCESS(PSMC4INT,6)
// PSMC4INT<P4TPHIF>
extern volatile __bit                   P4TPHIF             __at(0x7902);	// @ (0xF20 * 8 + 2)
#define                                 P4TPHIF_bit         _BIT_ACCESS(PSMC4INT,2)
// PSMC4INT<P4TPRIE>
extern volatile __bit                   P4TPRIE             __at(0x7904);	// @ (0xF20 * 8 + 4)
#define                                 P4TPRIE_bit         _BIT_ACCESS(PSMC4INT,4)
// PSMC4INT<P4TPRIF>
extern volatile __bit                   P4TPRIF             __at(0x7900);	// @ (0xF20 * 8 + 0)
#define                                 P4TPRIF_bit         _BIT_ACCESS(PSMC4INT,0)
// SSP1CON3<PCIE>
extern volatile __bit                   PCIE                __at(0x10BE);	// @ (0x217 * 8 + 6)
#define                                 PCIE_bit            _BIT_ACCESS(SSP1CON3,6)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN>
extern volatile __bit                   PEN                 __at(0x10B2);	// @ (0x216 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSP1CON2,2)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x4D6);	// @ (0x9A * 8 + 6)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,6)
// PIE4<PMSC3TIE>
extern volatile __bit                   PMSC3TIE            __at(0x4A6);	// @ (0x94 * 8 + 6)
#define                                 PMSC3TIE_bit        _BIT_ACCESS(PIE4,6)
// OPTION_REG<PS0>
extern volatile __bit                   _PS0                 __at(0x4A8);	// @ (0x95 * 8 + 0)  // Note: Changed by MikroE
#define                                 PS0_bit             _BIT_ACCESS(OPTION_REG,0)
// OPTION_REG<PS1>
extern volatile __bit                   _PS1                 __at(0x4A9);	// @ (0x95 * 8 + 1)  // Note: Changed by MikroE
#define                                 PS1_bit             _BIT_ACCESS(OPTION_REG,1)
// OPTION_REG<PS2>
extern volatile __bit                   _PS2                 __at(0x4AA);	// @ (0x95 * 8 + 2)  // Note: Changed by MikroE
#define                                 PS2_bit             _BIT_ACCESS(OPTION_REG,2)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x4AB);	// @ (0x95 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// PSMC1BLKF<PSMC1BLKF0>
extern volatile __bit                   PSMC1BLKF0          __at(0x7560);	// @ (0xEAC * 8 + 0)
#define                                 PSMC1BLKF0_bit      _BIT_ACCESS(PSMC1BLKF,0)
// PSMC1BLKF<PSMC1BLKF1>
extern volatile __bit                   PSMC1BLKF1          __at(0x7561);	// @ (0xEAC * 8 + 1)
#define                                 PSMC1BLKF1_bit      _BIT_ACCESS(PSMC1BLKF,1)
// PSMC1BLKF<PSMC1BLKF2>
extern volatile __bit                   PSMC1BLKF2          __at(0x7562);	// @ (0xEAC * 8 + 2)
#define                                 PSMC1BLKF2_bit      _BIT_ACCESS(PSMC1BLKF,2)
// PSMC1BLKF<PSMC1BLKF3>
extern volatile __bit                   PSMC1BLKF3          __at(0x7563);	// @ (0xEAC * 8 + 3)
#define                                 PSMC1BLKF3_bit      _BIT_ACCESS(PSMC1BLKF,3)
// PSMC1BLKF<PSMC1BLKF4>
extern volatile __bit                   PSMC1BLKF4          __at(0x7564);	// @ (0xEAC * 8 + 4)
#define                                 PSMC1BLKF4_bit      _BIT_ACCESS(PSMC1BLKF,4)
// PSMC1BLKF<PSMC1BLKF5>
extern volatile __bit                   PSMC1BLKF5          __at(0x7565);	// @ (0xEAC * 8 + 5)
#define                                 PSMC1BLKF5_bit      _BIT_ACCESS(PSMC1BLKF,5)
// PSMC1BLKF<PSMC1BLKF6>
extern volatile __bit                   PSMC1BLKF6          __at(0x7566);	// @ (0xEAC * 8 + 6)
#define                                 PSMC1BLKF6_bit      _BIT_ACCESS(PSMC1BLKF,6)
// PSMC1BLKF<PSMC1BLKF7>
extern volatile __bit                   PSMC1BLKF7          __at(0x7567);	// @ (0xEAC * 8 + 7)
#define                                 PSMC1BLKF7_bit      _BIT_ACCESS(PSMC1BLKF,7)
// PSMC1BLKR<PSMC1BLKR0>
extern volatile __bit                   PSMC1BLKR0          __at(0x7558);	// @ (0xEAB * 8 + 0)
#define                                 PSMC1BLKR0_bit      _BIT_ACCESS(PSMC1BLKR,0)
// PSMC1BLKR<PSMC1BLKR1>
extern volatile __bit                   PSMC1BLKR1          __at(0x7559);	// @ (0xEAB * 8 + 1)
#define                                 PSMC1BLKR1_bit      _BIT_ACCESS(PSMC1BLKR,1)
// PSMC1BLKR<PSMC1BLKR2>
extern volatile __bit                   PSMC1BLKR2          __at(0x755A);	// @ (0xEAB * 8 + 2)
#define                                 PSMC1BLKR2_bit      _BIT_ACCESS(PSMC1BLKR,2)
// PSMC1BLKR<PSMC1BLKR3>
extern volatile __bit                   PSMC1BLKR3          __at(0x755B);	// @ (0xEAB * 8 + 3)
#define                                 PSMC1BLKR3_bit      _BIT_ACCESS(PSMC1BLKR,3)
// PSMC1BLKR<PSMC1BLKR4>
extern volatile __bit                   PSMC1BLKR4          __at(0x755C);	// @ (0xEAB * 8 + 4)
#define                                 PSMC1BLKR4_bit      _BIT_ACCESS(PSMC1BLKR,4)
// PSMC1BLKR<PSMC1BLKR5>
extern volatile __bit                   PSMC1BLKR5          __at(0x755D);	// @ (0xEAB * 8 + 5)
#define                                 PSMC1BLKR5_bit      _BIT_ACCESS(PSMC1BLKR,5)
// PSMC1BLKR<PSMC1BLKR6>
extern volatile __bit                   PSMC1BLKR6          __at(0x755E);	// @ (0xEAB * 8 + 6)
#define                                 PSMC1BLKR6_bit      _BIT_ACCESS(PSMC1BLKR,6)
// PSMC1BLKR<PSMC1BLKR7>
extern volatile __bit                   PSMC1BLKR7          __at(0x755F);	// @ (0xEAB * 8 + 7)
#define                                 PSMC1BLKR7_bit      _BIT_ACCESS(PSMC1BLKR,7)
// PSMC1DBF<PSMC1DBF0>
extern volatile __bit                   PSMC1DBF0           __at(0x7550);	// @ (0xEAA * 8 + 0)
#define                                 PSMC1DBF0_bit       _BIT_ACCESS(PSMC1DBF,0)
// PSMC1DBF<PSMC1DBF1>
extern volatile __bit                   PSMC1DBF1           __at(0x7551);	// @ (0xEAA * 8 + 1)
#define                                 PSMC1DBF1_bit       _BIT_ACCESS(PSMC1DBF,1)
// PSMC1DBF<PSMC1DBF2>
extern volatile __bit                   PSMC1DBF2           __at(0x7552);	// @ (0xEAA * 8 + 2)
#define                                 PSMC1DBF2_bit       _BIT_ACCESS(PSMC1DBF,2)
// PSMC1DBF<PSMC1DBF3>
extern volatile __bit                   PSMC1DBF3           __at(0x7553);	// @ (0xEAA * 8 + 3)
#define                                 PSMC1DBF3_bit       _BIT_ACCESS(PSMC1DBF,3)
// PSMC1DBF<PSMC1DBF4>
extern volatile __bit                   PSMC1DBF4           __at(0x7554);	// @ (0xEAA * 8 + 4)
#define                                 PSMC1DBF4_bit       _BIT_ACCESS(PSMC1DBF,4)
// PSMC1DBF<PSMC1DBF5>
extern volatile __bit                   PSMC1DBF5           __at(0x7555);	// @ (0xEAA * 8 + 5)
#define                                 PSMC1DBF5_bit       _BIT_ACCESS(PSMC1DBF,5)
// PSMC1DBF<PSMC1DBF6>
extern volatile __bit                   PSMC1DBF6           __at(0x7556);	// @ (0xEAA * 8 + 6)
#define                                 PSMC1DBF6_bit       _BIT_ACCESS(PSMC1DBF,6)
// PSMC1DBF<PSMC1DBF7>
extern volatile __bit                   PSMC1DBF7           __at(0x7557);	// @ (0xEAA * 8 + 7)
#define                                 PSMC1DBF7_bit       _BIT_ACCESS(PSMC1DBF,7)
// PSMC1DBR<PSMC1DBR0>
extern volatile __bit                   PSMC1DBR0           __at(0x7548);	// @ (0xEA9 * 8 + 0)
#define                                 PSMC1DBR0_bit       _BIT_ACCESS(PSMC1DBR,0)
// PSMC1DBR<PSMC1DBR1>
extern volatile __bit                   PSMC1DBR1           __at(0x7549);	// @ (0xEA9 * 8 + 1)
#define                                 PSMC1DBR1_bit       _BIT_ACCESS(PSMC1DBR,1)
// PSMC1DBR<PSMC1DBR2>
extern volatile __bit                   PSMC1DBR2           __at(0x754A);	// @ (0xEA9 * 8 + 2)
#define                                 PSMC1DBR2_bit       _BIT_ACCESS(PSMC1DBR,2)
// PSMC1DBR<PSMC1DBR3>
extern volatile __bit                   PSMC1DBR3           __at(0x754B);	// @ (0xEA9 * 8 + 3)
#define                                 PSMC1DBR3_bit       _BIT_ACCESS(PSMC1DBR,3)
// PSMC1DBR<PSMC1DBR4>
extern volatile __bit                   PSMC1DBR4           __at(0x754C);	// @ (0xEA9 * 8 + 4)
#define                                 PSMC1DBR4_bit       _BIT_ACCESS(PSMC1DBR,4)
// PSMC1DBR<PSMC1DBR5>
extern volatile __bit                   PSMC1DBR5           __at(0x754D);	// @ (0xEA9 * 8 + 5)
#define                                 PSMC1DBR5_bit       _BIT_ACCESS(PSMC1DBR,5)
// PSMC1DBR<PSMC1DBR6>
extern volatile __bit                   PSMC1DBR6           __at(0x754E);	// @ (0xEA9 * 8 + 6)
#define                                 PSMC1DBR6_bit       _BIT_ACCESS(PSMC1DBR,6)
// PSMC1DBR<PSMC1DBR7>
extern volatile __bit                   PSMC1DBR7           __at(0x754F);	// @ (0xEA9 * 8 + 7)
#define                                 PSMC1DBR7_bit       _BIT_ACCESS(PSMC1DBR,7)
// PSMC1DCL<PSMC1DC0>
extern volatile __bit                   PSMC1DC0            __at(0x7518);	// @ (0xEA3 * 8 + 0)
#define                                 PSMC1DC0_bit        _BIT_ACCESS(PSMC1DCL,0)
// PSMC1DCL<PSMC1DC1>
extern volatile __bit                   PSMC1DC1            __at(0x7519);	// @ (0xEA3 * 8 + 1)
#define                                 PSMC1DC1_bit        _BIT_ACCESS(PSMC1DCL,1)
// PSMC1DCH<PSMC1DC10>
extern volatile __bit                   PSMC1DC10           __at(0x7522);	// @ (0xEA4 * 8 + 2)
#define                                 PSMC1DC10_bit       _BIT_ACCESS(PSMC1DCH,2)
// PSMC1DCH<PSMC1DC11>
extern volatile __bit                   PSMC1DC11           __at(0x7523);	// @ (0xEA4 * 8 + 3)
#define                                 PSMC1DC11_bit       _BIT_ACCESS(PSMC1DCH,3)
// PSMC1DCH<PSMC1DC12>
extern volatile __bit                   PSMC1DC12           __at(0x7524);	// @ (0xEA4 * 8 + 4)
#define                                 PSMC1DC12_bit       _BIT_ACCESS(PSMC1DCH,4)
// PSMC1DCH<PSMC1DC13>
extern volatile __bit                   PSMC1DC13           __at(0x7525);	// @ (0xEA4 * 8 + 5)
#define                                 PSMC1DC13_bit       _BIT_ACCESS(PSMC1DCH,5)
// PSMC1DCH<PSMC1DC14>
extern volatile __bit                   PSMC1DC14           __at(0x7526);	// @ (0xEA4 * 8 + 6)
#define                                 PSMC1DC14_bit       _BIT_ACCESS(PSMC1DCH,6)
// PSMC1DCH<PSMC1DC15>
extern volatile __bit                   PSMC1DC15           __at(0x7527);	// @ (0xEA4 * 8 + 7)
#define                                 PSMC1DC15_bit       _BIT_ACCESS(PSMC1DCH,7)
// PSMC1DCL<PSMC1DC2>
extern volatile __bit                   PSMC1DC2            __at(0x751A);	// @ (0xEA3 * 8 + 2)
#define                                 PSMC1DC2_bit        _BIT_ACCESS(PSMC1DCL,2)
// PSMC1DCL<PSMC1DC3>
extern volatile __bit                   PSMC1DC3            __at(0x751B);	// @ (0xEA3 * 8 + 3)
#define                                 PSMC1DC3_bit        _BIT_ACCESS(PSMC1DCL,3)
// PSMC1DCL<PSMC1DC4>
extern volatile __bit                   PSMC1DC4            __at(0x751C);	// @ (0xEA3 * 8 + 4)
#define                                 PSMC1DC4_bit        _BIT_ACCESS(PSMC1DCL,4)
// PSMC1DCL<PSMC1DC5>
extern volatile __bit                   PSMC1DC5            __at(0x751D);	// @ (0xEA3 * 8 + 5)
#define                                 PSMC1DC5_bit        _BIT_ACCESS(PSMC1DCL,5)
// PSMC1DCL<PSMC1DC6>
extern volatile __bit                   PSMC1DC6            __at(0x751E);	// @ (0xEA3 * 8 + 6)
#define                                 PSMC1DC6_bit        _BIT_ACCESS(PSMC1DCL,6)
// PSMC1DCL<PSMC1DC7>
extern volatile __bit                   PSMC1DC7            __at(0x751F);	// @ (0xEA3 * 8 + 7)
#define                                 PSMC1DC7_bit        _BIT_ACCESS(PSMC1DCL,7)
// PSMC1DCH<PSMC1DC8>
extern volatile __bit                   PSMC1DC8            __at(0x7520);	// @ (0xEA4 * 8 + 0)
