MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1788/mcu.h
extern volatile __bit                   PSMC2PH13           __at(0x7615);	// @ (0xEC2 * 8 + 5)
#define                                 PSMC2PH13_bit       _BIT_ACCESS(PSMC2PHH,5)
// PSMC2PHH<PSMC2PH14>
extern volatile __bit                   PSMC2PH14           __at(0x7616);	// @ (0xEC2 * 8 + 6)
#define                                 PSMC2PH14_bit       _BIT_ACCESS(PSMC2PHH,6)
// PSMC2PHH<PSMC2PH15>
extern volatile __bit                   PSMC2PH15           __at(0x7617);	// @ (0xEC2 * 8 + 7)
#define                                 PSMC2PH15_bit       _BIT_ACCESS(PSMC2PHH,7)
// PSMC2PHL<PSMC2PH2>
extern volatile __bit                   PSMC2PH2            __at(0x760A);	// @ (0xEC1 * 8 + 2)
#define                                 PSMC2PH2_bit        _BIT_ACCESS(PSMC2PHL,2)
// PSMC2PHL<PSMC2PH3>
extern volatile __bit                   PSMC2PH3            __at(0x760B);	// @ (0xEC1 * 8 + 3)
#define                                 PSMC2PH3_bit        _BIT_ACCESS(PSMC2PHL,3)
// PSMC2PHL<PSMC2PH4>
extern volatile __bit                   PSMC2PH4            __at(0x760C);	// @ (0xEC1 * 8 + 4)
#define                                 PSMC2PH4_bit        _BIT_ACCESS(PSMC2PHL,4)
// PSMC2PHL<PSMC2PH5>
extern volatile __bit                   PSMC2PH5            __at(0x760D);	// @ (0xEC1 * 8 + 5)
#define                                 PSMC2PH5_bit        _BIT_ACCESS(PSMC2PHL,5)
// PSMC2PHL<PSMC2PH6>
extern volatile __bit                   PSMC2PH6            __at(0x760E);	// @ (0xEC1 * 8 + 6)
#define                                 PSMC2PH6_bit        _BIT_ACCESS(PSMC2PHL,6)
// PSMC2PHL<PSMC2PH7>
extern volatile __bit                   PSMC2PH7            __at(0x760F);	// @ (0xEC1 * 8 + 7)
#define                                 PSMC2PH7_bit        _BIT_ACCESS(PSMC2PHL,7)
// PSMC2PHH<PSMC2PH8>
extern volatile __bit                   PSMC2PH8            __at(0x7610);	// @ (0xEC2 * 8 + 0)
#define                                 PSMC2PH8_bit        _BIT_ACCESS(PSMC2PHH,0)
// PSMC2PHH<PSMC2PH9>
extern volatile __bit                   PSMC2PH9            __at(0x7611);	// @ (0xEC2 * 8 + 1)
#define                                 PSMC2PH9_bit        _BIT_ACCESS(PSMC2PHH,1)
// PSMC2PRL<PSMC2PR0>
extern volatile __bit                   PSMC2PR0            __at(0x7628);	// @ (0xEC5 * 8 + 0)
#define                                 PSMC2PR0_bit        _BIT_ACCESS(PSMC2PRL,0)
// PSMC2PRL<PSMC2PR1>
extern volatile __bit                   PSMC2PR1            __at(0x7629);	// @ (0xEC5 * 8 + 1)
#define                                 PSMC2PR1_bit        _BIT_ACCESS(PSMC2PRL,1)
// PSMC2PRH<PSMC2PR10>
extern volatile __bit                   PSMC2PR10           __at(0x7632);	// @ (0xEC6 * 8 + 2)
#define                                 PSMC2PR10_bit       _BIT_ACCESS(PSMC2PRH,2)
// PSMC2PRH<PSMC2PR11>
extern volatile __bit                   PSMC2PR11           __at(0x7633);	// @ (0xEC6 * 8 + 3)
#define                                 PSMC2PR11_bit       _BIT_ACCESS(PSMC2PRH,3)
// PSMC2PRH<PSMC2PR12>
extern volatile __bit                   PSMC2PR12           __at(0x7634);	// @ (0xEC6 * 8 + 4)
#define                                 PSMC2PR12_bit       _BIT_ACCESS(PSMC2PRH,4)
// PSMC2PRH<PSMC2PR13>
extern volatile __bit                   PSMC2PR13           __at(0x7635);	// @ (0xEC6 * 8 + 5)
#define                                 PSMC2PR13_bit       _BIT_ACCESS(PSMC2PRH,5)
// PSMC2PRH<PSMC2PR14>
extern volatile __bit                   PSMC2PR14           __at(0x7636);	// @ (0xEC6 * 8 + 6)
#define                                 PSMC2PR14_bit       _BIT_ACCESS(PSMC2PRH,6)
// PSMC2PRH<PSMC2PR15>
extern volatile __bit                   PSMC2PR15           __at(0x7637);	// @ (0xEC6 * 8 + 7)
#define                                 PSMC2PR15_bit       _BIT_ACCESS(PSMC2PRH,7)
// PSMC2PRL<PSMC2PR2>
extern volatile __bit                   PSMC2PR2            __at(0x762A);	// @ (0xEC5 * 8 + 2)
#define                                 PSMC2PR2_bit        _BIT_ACCESS(PSMC2PRL,2)
// PSMC2PRL<PSMC2PR3>
extern volatile __bit                   PSMC2PR3            __at(0x762B);	// @ (0xEC5 * 8 + 3)
#define                                 PSMC2PR3_bit        _BIT_ACCESS(PSMC2PRL,3)
// PSMC2PRL<PSMC2PR4>
extern volatile __bit                   PSMC2PR4            __at(0x762C);	// @ (0xEC5 * 8 + 4)
#define                                 PSMC2PR4_bit        _BIT_ACCESS(PSMC2PRL,4)
// PSMC2PRL<PSMC2PR5>
extern volatile __bit                   PSMC2PR5            __at(0x762D);	// @ (0xEC5 * 8 + 5)
#define                                 PSMC2PR5_bit        _BIT_ACCESS(PSMC2PRL,5)
// PSMC2PRL<PSMC2PR6>
extern volatile __bit                   PSMC2PR6            __at(0x762E);	// @ (0xEC5 * 8 + 6)
#define                                 PSMC2PR6_bit        _BIT_ACCESS(PSMC2PRL,6)
// PSMC2PRL<PSMC2PR7>
extern volatile __bit                   PSMC2PR7            __at(0x762F);	// @ (0xEC5 * 8 + 7)
#define                                 PSMC2PR7_bit        _BIT_ACCESS(PSMC2PRL,7)
// PSMC2PRH<PSMC2PR8>
extern volatile __bit                   PSMC2PR8            __at(0x7630);	// @ (0xEC6 * 8 + 0)
#define                                 PSMC2PR8_bit        _BIT_ACCESS(PSMC2PRH,0)
// PSMC2PRH<PSMC2PR9>
extern volatile __bit                   PSMC2PR9            __at(0x7631);	// @ (0xEC6 * 8 + 1)
#define                                 PSMC2PR9_bit        _BIT_ACCESS(PSMC2PRH,1)
// PIE4<PSMC2SIE>
extern volatile __bit                   PSMC2SIE            __at(0x4A1);	// @ (0x94 * 8 + 1)
#define                                 PSMC2SIE_bit        _BIT_ACCESS(PIE4,1)
// PIR4<PSMC2SIF>
extern volatile __bit                   PSMC2SIF            __at(0xA1);	// @ (0x14 * 8 + 1)
#define                                 PSMC2SIF_bit        _BIT_ACCESS(PIR4,1)
// PIE4<PSMC2TIE>
extern volatile __bit                   PSMC2TIE            __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 PSMC2TIE_bit        _BIT_ACCESS(PIE4,5)
// PIR4<PSMC2TIF>
extern volatile __bit                   PSMC2TIF            __at(0xA5);	// @ (0x14 * 8 + 5)
#define                                 PSMC2TIF_bit        _BIT_ACCESS(PIR4,5)
// PSMC2TMRL<PSMC2TMR0>
extern volatile __bit                   PSMC2TMR0           __at(0x7638);	// @ (0xEC7 * 8 + 0)
#define                                 PSMC2TMR0_bit       _BIT_ACCESS(PSMC2TMRL,0)
// PSMC2TMRL<PSMC2TMR1>
extern volatile __bit                   PSMC2TMR1           __at(0x7639);	// @ (0xEC7 * 8 + 1)
#define                                 PSMC2TMR1_bit       _BIT_ACCESS(PSMC2TMRL,1)
// PSMC2TMRH<PSMC2TMR10>
extern volatile __bit                   PSMC2TMR10          __at(0x7642);	// @ (0xEC8 * 8 + 2)
#define                                 PSMC2TMR10_bit      _BIT_ACCESS(PSMC2TMRH,2)
// PSMC2TMRH<PSMC2TMR11>
extern volatile __bit                   PSMC2TMR11          __at(0x7643);	// @ (0xEC8 * 8 + 3)
#define                                 PSMC2TMR11_bit      _BIT_ACCESS(PSMC2TMRH,3)
// PSMC2TMRH<PSMC2TMR12>
extern volatile __bit                   PSMC2TMR12          __at(0x7644);	// @ (0xEC8 * 8 + 4)
#define                                 PSMC2TMR12_bit      _BIT_ACCESS(PSMC2TMRH,4)
// PSMC2TMRH<PSMC2TMR13>
extern volatile __bit                   PSMC2TMR13          __at(0x7645);	// @ (0xEC8 * 8 + 5)
#define                                 PSMC2TMR13_bit      _BIT_ACCESS(PSMC2TMRH,5)
// PSMC2TMRH<PSMC2TMR14>
extern volatile __bit                   PSMC2TMR14          __at(0x7646);	// @ (0xEC8 * 8 + 6)
#define                                 PSMC2TMR14_bit      _BIT_ACCESS(PSMC2TMRH,6)
// PSMC2TMRH<PSMC2TMR15>
extern volatile __bit                   PSMC2TMR15          __at(0x7647);	// @ (0xEC8 * 8 + 7)
#define                                 PSMC2TMR15_bit      _BIT_ACCESS(PSMC2TMRH,7)
// PSMC2TMRL<PSMC2TMR2>
extern volatile __bit                   PSMC2TMR2           __at(0x763A);	// @ (0xEC7 * 8 + 2)
#define                                 PSMC2TMR2_bit       _BIT_ACCESS(PSMC2TMRL,2)
// PSMC2TMRL<PSMC2TMR3>
extern volatile __bit                   PSMC2TMR3           __at(0x763B);	// @ (0xEC7 * 8 + 3)
#define                                 PSMC2TMR3_bit       _BIT_ACCESS(PSMC2TMRL,3)
// PSMC2TMRL<PSMC2TMR4>
extern volatile __bit                   PSMC2TMR4           __at(0x763C);	// @ (0xEC7 * 8 + 4)
#define                                 PSMC2TMR4_bit       _BIT_ACCESS(PSMC2TMRL,4)
// PSMC2TMRL<PSMC2TMR5>
extern volatile __bit                   PSMC2TMR5           __at(0x763D);	// @ (0xEC7 * 8 + 5)
#define                                 PSMC2TMR5_bit       _BIT_ACCESS(PSMC2TMRL,5)
// PSMC2TMRL<PSMC2TMR6>
extern volatile __bit                   PSMC2TMR6           __at(0x763E);	// @ (0xEC7 * 8 + 6)
#define                                 PSMC2TMR6_bit       _BIT_ACCESS(PSMC2TMRL,6)
// PSMC2TMRL<PSMC2TMR7>
extern volatile __bit                   PSMC2TMR7           __at(0x763F);	// @ (0xEC7 * 8 + 7)
#define                                 PSMC2TMR7_bit       _BIT_ACCESS(PSMC2TMRL,7)
// PSMC2TMRH<PSMC2TMR8>
extern volatile __bit                   PSMC2TMR8           __at(0x7640);	// @ (0xEC8 * 8 + 0)
#define                                 PSMC2TMR8_bit       _BIT_ACCESS(PSMC2TMRH,0)
// PSMC2TMRH<PSMC2TMR9>
extern volatile __bit                   PSMC2TMR9           __at(0x7641);	// @ (0xEC8 * 8 + 1)
#define                                 PSMC2TMR9_bit       _BIT_ACCESS(PSMC2TMRH,1)
// PSMC3BLKF<PSMC3BLKF0>
extern volatile __bit                   PSMC3BLKF0          __at(0x7760);	// @ (0xEEC * 8 + 0)
#define                                 PSMC3BLKF0_bit      _BIT_ACCESS(PSMC3BLKF,0)
// PSMC3BLKF<PSMC3BLKF1>
extern volatile __bit                   PSMC3BLKF1          __at(0x7761);	// @ (0xEEC * 8 + 1)
#define                                 PSMC3BLKF1_bit      _BIT_ACCESS(PSMC3BLKF,1)
// PSMC3BLKF<PSMC3BLKF2>
extern volatile __bit                   PSMC3BLKF2          __at(0x7762);	// @ (0xEEC * 8 + 2)
#define                                 PSMC3BLKF2_bit      _BIT_ACCESS(PSMC3BLKF,2)
// PSMC3BLKF<PSMC3BLKF3>
extern volatile __bit                   PSMC3BLKF3          __at(0x7763);	// @ (0xEEC * 8 + 3)
#define                                 PSMC3BLKF3_bit      _BIT_ACCESS(PSMC3BLKF,3)
// PSMC3BLKF<PSMC3BLKF4>
extern volatile __bit                   PSMC3BLKF4          __at(0x7764);	// @ (0xEEC * 8 + 4)
#define                                 PSMC3BLKF4_bit      _BIT_ACCESS(PSMC3BLKF,4)
// PSMC3BLKF<PSMC3BLKF5>
extern volatile __bit                   PSMC3BLKF5          __at(0x7765);	// @ (0xEEC * 8 + 5)
#define                                 PSMC3BLKF5_bit      _BIT_ACCESS(PSMC3BLKF,5)
// PSMC3BLKF<PSMC3BLKF6>
extern volatile __bit                   PSMC3BLKF6          __at(0x7766);	// @ (0xEEC * 8 + 6)
#define                                 PSMC3BLKF6_bit      _BIT_ACCESS(PSMC3BLKF,6)
// PSMC3BLKF<PSMC3BLKF7>
extern volatile __bit                   PSMC3BLKF7          __at(0x7767);	// @ (0xEEC * 8 + 7)
#define                                 PSMC3BLKF7_bit      _BIT_ACCESS(PSMC3BLKF,7)
// PSMC3BLKR<PSMC3BLKR0>
extern volatile __bit                   PSMC3BLKR0          __at(0x7758);	// @ (0xEEB * 8 + 0)
#define                                 PSMC3BLKR0_bit      _BIT_ACCESS(PSMC3BLKR,0)
// PSMC3BLKR<PSMC3BLKR1>
extern volatile __bit                   PSMC3BLKR1          __at(0x7759);	// @ (0xEEB * 8 + 1)
#define                                 PSMC3BLKR1_bit      _BIT_ACCESS(PSMC3BLKR,1)
// PSMC3BLKR<PSMC3BLKR2>
extern volatile __bit                   PSMC3BLKR2          __at(0x775A);	// @ (0xEEB * 8 + 2)
#define                                 PSMC3BLKR2_bit      _BIT_ACCESS(PSMC3BLKR,2)
// PSMC3BLKR<PSMC3BLKR3>
extern volatile __bit                   PSMC3BLKR3          __at(0x775B);	// @ (0xEEB * 8 + 3)
#define                                 PSMC3BLKR3_bit      _BIT_ACCESS(PSMC3BLKR,3)
// PSMC3BLKR<PSMC3BLKR4>
extern volatile __bit                   PSMC3BLKR4          __at(0x775C);	// @ (0xEEB * 8 + 4)
#define                                 PSMC3BLKR4_bit      _BIT_ACCESS(PSMC3BLKR,4)
// PSMC3BLKR<PSMC3BLKR5>
extern volatile __bit                   PSMC3BLKR5          __at(0x775D);	// @ (0xEEB * 8 + 5)
#define                                 PSMC3BLKR5_bit      _BIT_ACCESS(PSMC3BLKR,5)
// PSMC3BLKR<PSMC3BLKR6>
extern volatile __bit                   PSMC3BLKR6          __at(0x775E);	// @ (0xEEB * 8 + 6)
#define                                 PSMC3BLKR6_bit      _BIT_ACCESS(PSMC3BLKR,6)
// PSMC3BLKR<PSMC3BLKR7>
extern volatile __bit                   PSMC3BLKR7          __at(0x775F);	// @ (0xEEB * 8 + 7)
#define                                 PSMC3BLKR7_bit      _BIT_ACCESS(PSMC3BLKR,7)
// PSMC3DBF<PSMC3DBF0>
extern volatile __bit                   PSMC3DBF0           __at(0x7750);	// @ (0xEEA * 8 + 0)
#define                                 PSMC3DBF0_bit       _BIT_ACCESS(PSMC3DBF,0)
// PSMC3DBF<PSMC3DBF1>
extern volatile __bit                   PSMC3DBF1           __at(0x7751);	// @ (0xEEA * 8 + 1)
#define                                 PSMC3DBF1_bit       _BIT_ACCESS(PSMC3DBF,1)
// PSMC3DBF<PSMC3DBF2>
extern volatile __bit                   PSMC3DBF2           __at(0x7752);	// @ (0xEEA * 8 + 2)
#define                                 PSMC3DBF2_bit       _BIT_ACCESS(PSMC3DBF,2)
// PSMC3DBF<PSMC3DBF3>
extern volatile __bit                   PSMC3DBF3           __at(0x7753);	// @ (0xEEA * 8 + 3)
#define                                 PSMC3DBF3_bit       _BIT_ACCESS(PSMC3DBF,3)
// PSMC3DBF<PSMC3DBF4>
extern volatile __bit                   PSMC3DBF4           __at(0x7754);	// @ (0xEEA * 8 + 4)
#define                                 PSMC3DBF4_bit       _BIT_ACCESS(PSMC3DBF,4)
// PSMC3DBF<PSMC3DBF5>
extern volatile __bit                   PSMC3DBF5           __at(0x7755);	// @ (0xEEA * 8 + 5)
#define                                 PSMC3DBF5_bit       _BIT_ACCESS(PSMC3DBF,5)
// PSMC3DBF<PSMC3DBF6>
extern volatile __bit                   PSMC3DBF6           __at(0x7756);	// @ (0xEEA * 8 + 6)
#define                                 PSMC3DBF6_bit       _BIT_ACCESS(PSMC3DBF,6)
// PSMC3DBF<PSMC3DBF7>
extern volatile __bit                   PSMC3DBF7           __at(0x7757);	// @ (0xEEA * 8 + 7)
#define                                 PSMC3DBF7_bit       _BIT_ACCESS(PSMC3DBF,7)
// PSMC3DBR<PSMC3DBR0>
extern volatile __bit                   PSMC3DBR0           __at(0x7748);	// @ (0xEE9 * 8 + 0)
#define                                 PSMC3DBR0_bit       _BIT_ACCESS(PSMC3DBR,0)
// PSMC3DBR<PSMC3DBR1>
extern volatile __bit                   PSMC3DBR1           __at(0x7749);	// @ (0xEE9 * 8 + 1)
#define                                 PSMC3DBR1_bit       _BIT_ACCESS(PSMC3DBR,1)
// PSMC3DBR<PSMC3DBR2>
extern volatile __bit                   PSMC3DBR2           __at(0x774A);	// @ (0xEE9 * 8 + 2)
#define                                 PSMC3DBR2_bit       _BIT_ACCESS(PSMC3DBR,2)
// PSMC3DBR<PSMC3DBR3>
extern volatile __bit                   PSMC3DBR3           __at(0x774B);	// @ (0xEE9 * 8 + 3)
#define                                 PSMC3DBR3_bit       _BIT_ACCESS(PSMC3DBR,3)
// PSMC3DBR<PSMC3DBR4>
extern volatile __bit                   PSMC3DBR4           __at(0x774C);	// @ (0xEE9 * 8 + 4)
#define                                 PSMC3DBR4_bit       _BIT_ACCESS(PSMC3DBR,4)
// PSMC3DBR<PSMC3DBR5>
extern volatile __bit                   PSMC3DBR5           __at(0x774D);	// @ (0xEE9 * 8 + 5)
#define                                 PSMC3DBR5_bit       _BIT_ACCESS(PSMC3DBR,5)
// PSMC3DBR<PSMC3DBR6>
extern volatile __bit                   PSMC3DBR6           __at(0x774E);	// @ (0xEE9 * 8 + 6)
#define                                 PSMC3DBR6_bit       _BIT_ACCESS(PSMC3DBR,6)
// PSMC3DBR<PSMC3DBR7>
extern volatile __bit                   PSMC3DBR7           __at(0x774F);	// @ (0xEE9 * 8 + 7)
#define                                 PSMC3DBR7_bit       _BIT_ACCESS(PSMC3DBR,7)
// PSMC3DCL<PSMC3DC0>
extern volatile __bit                   PSMC3DC0            __at(0x7718);	// @ (0xEE3 * 8 + 0)
#define                                 PSMC3DC0_bit        _BIT_ACCESS(PSMC3DCL,0)
// PSMC3DCL<PSMC3DC1>
extern volatile __bit                   PSMC3DC1            __at(0x7719);	// @ (0xEE3 * 8 + 1)
#define                                 PSMC3DC1_bit        _BIT_ACCESS(PSMC3DCL,1)
// PSMC3DCH<PSMC3DC10>
extern volatile __bit                   PSMC3DC10           __at(0x7722);	// @ (0xEE4 * 8 + 2)
#define                                 PSMC3DC10_bit       _BIT_ACCESS(PSMC3DCH,2)
// PSMC3DCH<PSMC3DC11>
extern volatile __bit                   PSMC3DC11           __at(0x7723);	// @ (0xEE4 * 8 + 3)
#define                                 PSMC3DC11_bit       _BIT_ACCESS(PSMC3DCH,3)
// PSMC3DCH<PSMC3DC12>
extern volatile __bit                   PSMC3DC12           __at(0x7724);	// @ (0xEE4 * 8 + 4)
#define                                 PSMC3DC12_bit       _BIT_ACCESS(PSMC3DCH,4)
// PSMC3DCH<PSMC3DC13>
extern volatile __bit                   PSMC3DC13           __at(0x7725);	// @ (0xEE4 * 8 + 5)
#define                                 PSMC3DC13_bit       _BIT_ACCESS(PSMC3DCH,5)
// PSMC3DCH<PSMC3DC14>
extern volatile __bit                   PSMC3DC14           __at(0x7726);	// @ (0xEE4 * 8 + 6)
#define                                 PSMC3DC14_bit       _BIT_ACCESS(PSMC3DCH,6)
// PSMC3DCH<PSMC3DC15>
extern volatile __bit                   PSMC3DC15           __at(0x7727);	// @ (0xEE4 * 8 + 7)
#define                                 PSMC3DC15_bit       _BIT_ACCESS(PSMC3DCH,7)
// PSMC3DCL<PSMC3DC2>
extern volatile __bit                   PSMC3DC2            __at(0x771A);	// @ (0xEE3 * 8 + 2)
#define                                 PSMC3DC2_bit        _BIT_ACCESS(PSMC3DCL,2)
// PSMC3DCL<PSMC3DC3>
extern volatile __bit                   PSMC3DC3            __at(0x771B);	// @ (0xEE3 * 8 + 3)
#define                                 PSMC3DC3_bit        _BIT_ACCESS(PSMC3DCL,3)
// PSMC3DCL<PSMC3DC4>
extern volatile __bit                   PSMC3DC4            __at(0x771C);	// @ (0xEE3 * 8 + 4)
#define                                 PSMC3DC4_bit        _BIT_ACCESS(PSMC3DCL,4)
// PSMC3DCL<PSMC3DC5>
extern volatile __bit                   PSMC3DC5            __at(0x771D);	// @ (0xEE3 * 8 + 5)
#define                                 PSMC3DC5_bit        _BIT_ACCESS(PSMC3DCL,5)
// PSMC3DCL<PSMC3DC6>
extern volatile __bit                   PSMC3DC6            __at(0x771E);	// @ (0xEE3 * 8 + 6)
#define                                 PSMC3DC6_bit        _BIT_ACCESS(PSMC3DCL,6)
// PSMC3DCL<PSMC3DC7>
extern volatile __bit                   PSMC3DC7            __at(0x771F);	// @ (0xEE3 * 8 + 7)
#define                                 PSMC3DC7_bit        _BIT_ACCESS(PSMC3DCL,7)
// PSMC3DCH<PSMC3DC8>
extern volatile __bit                   PSMC3DC8            __at(0x7720);	// @ (0xEE4 * 8 + 0)
#define                                 PSMC3DC8_bit        _BIT_ACCESS(PSMC3DCH,0)
// PSMC3DCH<PSMC3DC9>
extern volatile __bit                   PSMC3DC9            __at(0x7721);	// @ (0xEE4 * 8 + 1)
#define                                 PSMC3DC9_bit        _BIT_ACCESS(PSMC3DCH,1)
// PSMC3CON<PSMC3EN>
extern volatile __bit                   PSMC3EN             __at(0x768F);	// @ (0xED1 * 8 + 7)
#define                                 PSMC3EN_bit         _BIT_ACCESS(PSMC3CON,7)
// PSMC3FFA<PSMC3FFA0>
extern volatile __bit                   PSMC3FFA0           __at(0x7768);	// @ (0xEED * 8 + 0)
#define                                 PSMC3FFA0_bit       _BIT_ACCESS(PSMC3FFA,0)
// PSMC3FFA<PSMC3FFA1>
extern volatile __bit                   PSMC3FFA1           __at(0x7769);	// @ (0xEED * 8 + 1)
#define                                 PSMC3FFA1_bit       _BIT_ACCESS(PSMC3FFA,1)
// PSMC3FFA<PSMC3FFA2>
extern volatile __bit                   PSMC3FFA2           __at(0x776A);	// @ (0xEED * 8 + 2)
#define                                 PSMC3FFA2_bit       _BIT_ACCESS(PSMC3FFA,2)
// PSMC3FFA<PSMC3FFA3>
extern volatile __bit                   PSMC3FFA3           __at(0x776B);	// @ (0xEED * 8 + 3)
#define                                 PSMC3FFA3_bit       _BIT_ACCESS(PSMC3FFA,3)
// PSMC3CON<PSMC3LD>
extern volatile __bit                   PSMC3LD             __at(0x768E);	// @ (0xED1 * 8 + 6)
#define                                 PSMC3LD_bit         _BIT_ACCESS(PSMC3CON,6)
// PSMC3PHL<PSMC3PH0>
extern volatile __bit                   PSMC3PH0            __at(0x7708);	// @ (0xEE1 * 8 + 0)
#define                                 PSMC3PH0_bit        _BIT_ACCESS(PSMC3PHL,0)
// PSMC3PHL<PSMC3PH1>
extern volatile __bit                   PSMC3PH1            __at(0x7709);	// @ (0xEE1 * 8 + 1)
#define                                 PSMC3PH1_bit        _BIT_ACCESS(PSMC3PHL,1)
// PSMC3PHH<PSMC3PH10>
extern volatile __bit                   PSMC3PH10           __at(0x7712);	// @ (0xEE2 * 8 + 2)
#define                                 PSMC3PH10_bit       _BIT_ACCESS(PSMC3PHH,2)
// PSMC3PHH<PSMC3PH11>
extern volatile __bit                   PSMC3PH11           __at(0x7713);	// @ (0xEE2 * 8 + 3)
#define                                 PSMC3PH11_bit       _BIT_ACCESS(PSMC3PHH,3)
// PSMC3PHH<PSMC3PH12>
extern volatile __bit                   PSMC3PH12           __at(0x7714);	// @ (0xEE2 * 8 + 4)
#define                                 PSMC3PH12_bit       _BIT_ACCESS(PSMC3PHH,4)
// PSMC3PHH<PSMC3PH13>
extern volatile __bit                   PSMC3PH13           __at(0x7715);	// @ (0xEE2 * 8 + 5)
#define                                 PSMC3PH13_bit       _BIT_ACCESS(PSMC3PHH,5)
// PSMC3PHH<PSMC3PH14>
extern volatile __bit                   PSMC3PH14           __at(0x7716);	// @ (0xEE2 * 8 + 6)
#define                                 PSMC3PH14_bit       _BIT_ACCESS(PSMC3PHH,6)
// PSMC3PHH<PSMC3PH15>
extern volatile __bit                   PSMC3PH15           __at(0x7717);	// @ (0xEE2 * 8 + 7)
#define                                 PSMC3PH15_bit       _BIT_ACCESS(PSMC3PHH,7)
// PSMC3PHL<PSMC3PH2>
extern volatile __bit                   PSMC3PH2            __at(0x770A);	// @ (0xEE1 * 8 + 2)
#define                                 PSMC3PH2_bit        _BIT_ACCESS(PSMC3PHL,2)
// PSMC3PHL<PSMC3PH3>
extern volatile __bit                   PSMC3PH3            __at(0x770B);	// @ (0xEE1 * 8 + 3)
#define                                 PSMC3PH3_bit        _BIT_ACCESS(PSMC3PHL,3)
// PSMC3PHL<PSMC3PH4>
extern volatile __bit                   PSMC3PH4            __at(0x770C);	// @ (0xEE1 * 8 + 4)
#define                                 PSMC3PH4_bit        _BIT_ACCESS(PSMC3PHL,4)
// PSMC3PHL<PSMC3PH5>
extern volatile __bit                   PSMC3PH5            __at(0x770D);	// @ (0xEE1 * 8 + 5)
#define                                 PSMC3PH5_bit        _BIT_ACCESS(PSMC3PHL,5)
// PSMC3PHL<PSMC3PH6>
extern volatile __bit                   PSMC3PH6            __at(0x770E);	// @ (0xEE1 * 8 + 6)
#define                                 PSMC3PH6_bit        _BIT_ACCESS(PSMC3PHL,6)
// PSMC3PHL<PSMC3PH7>
extern volatile __bit                   PSMC3PH7            __at(0x770F);	// @ (0xEE1 * 8 + 7)
#define                                 PSMC3PH7_bit        _BIT_ACCESS(PSMC3PHL,7)
// PSMC3PHH<PSMC3PH8>
extern volatile __bit                   PSMC3PH8            __at(0x7710);	// @ (0xEE2 * 8 + 0)
#define                                 PSMC3PH8_bit        _BIT_ACCESS(PSMC3PHH,0)
// PSMC3PHH<PSMC3PH9>
extern volatile __bit                   PSMC3PH9            __at(0x7711);	// @ (0xEE2 * 8 + 1)
#define                                 PSMC3PH9_bit        _BIT_ACCESS(PSMC3PHH,1)
// PSMC3PRL<PSMC3PR0>
extern volatile __bit                   PSMC3PR0            __at(0x7728);	// @ (0xEE5 * 8 + 0)
#define                                 PSMC3PR0_bit        _BIT_ACCESS(PSMC3PRL,0)
// PSMC3PRL<PSMC3PR1>
extern volatile __bit                   PSMC3PR1            __at(0x7729);	// @ (0xEE5 * 8 + 1)
